using System;

namespace Combinations
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която изчислява колко решения в естествените числа (включително и нулата)
            //има уравнението:
            //x1 + x2 + x3 = n
            //Числото n е цяло число и се въвежда от конзолата. 

            //1. Четем числото n от конзолата
            int n = int.Parse(Console.ReadLine());
            int count = 0;

            ///Правим един цикъл за x1 и два вътрешни един в дуг за x2 и x3. които се въртят докато не стигнат числото входирано от конзолата 
            ///На първото завъртане х1 = 0, х2 = 0, х3 = 0. след това х1 = 0, х2 = 0, х3 = 1...... х1 = 0, х2 = 0, х3 = 10.
            ///х1 = 0, х2 = 1, х3 = 0.  х1 = 0, х2 = 1, х3 = 1......х1 = 0, х2 = 1, х3 = 10.
            ///х1 = 0, х2 = 2, х3 = 0.  х1 = 0, х2 = 2, х3 = 1......х1 = 0, х2 = 2, х3 = 10. .....х1 = 0, х2 = 10, х3 = 10. 
        //.....................
            ///в последният цикъл правим проверка и ако комбинацията от х1,х2,х3
            ///е равна на входираното число прибавяме едно към брояча. така цикъла се върти докато не намери всички комбинации и ако 
            ///някоя е равна на n добавя към брояча.
            for (int x1 = 0; x1 <= n; x1++)
            {
                for (int x2 = 0; x2 <=n; x2++)
                {
                    for (int x3 = 0; x3 <=n ; x3++)
                    {
                        if (x1+x2+x3 == n)
                        {
                            count++;
                        }
                    }
                }
            }

            Console.WriteLine(count);

        }
    }
}
