using System;

namespace SpecialNumbers
{
    class Program
    {
        static void Main(string[] args)
        {
            //Да се напише програма, която чете едно цяло число N, въведено от потребителя,
            //и генерира всички възможни "специални" числа от 1111 до 9999.За да бъде "специалнo" едно число,
            //то трябва да отговаря на следното условие: 
            //•	N да се дели на всяка една от неговите цифри без остатък.
            //Пример: при N = 16, 2418 е специално число:
            //•	16 / 2 = 8 без остатък
            //•	16 / 4 = 4 без остатък
            //•	16 / 1 = 16 без остатък
            //•	16 / 8 = 2 без остатък
            //Вход
            //Входът се чете от конзолата и се състои от едно цяло число в интервала[1…600000]
            //Изход
            //На конзолата трябва да се отпечатат всички "специални" числа, разделени с интервал


            //1.Четем числото N от конзолата
            int N = int.Parse(Console.ReadLine());

            //2. правим външен цикъл който да върти всички числа от  1111 до 9999
            //Вместо да правим цикъл от  1111 до 9999 който да върти толкова много числа
            //можем да направим толкова вложени цикли колкото са позициите в двете числа (в случаят 4 (1111)))
            //който да въртят от 1 до 9. Така ще имаме комбинациите от всичките числа, като първият цикъл(външен)
            // ще се върти от  1111 до като се извъртят вътрешните към 1999 след това ще стане 2 тоест 2111 към 2999 и тн. до 9999.
            //Май май пак толкова числа върти но важен е допълнителният начин
            for (int a = 1; a <= 9; a++)
            {
                for (int b = 1; b <= 9; b++)
                {
                    for (int c = 1; c <= 9; c++)
                    {
                        for (int d = 1; d <= 9; d++)
                        {
                            //Console.WriteLine($"{a}{b}{c}{d}");
                            if (N % a == 0 && N % b == 0 && N % c == 0 && N % d == 0)
                            {
                                Console.Write($"{a}{b}{c}{d} ");
                            }
                        }
                    }
                }
            }

        }
    }
}
