using System;

namespace AvarageNumber
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която прочита едно число n, след това прочита n на брой цели числа и принтира
            //средно аритметичното на тяхната сума число, форматирано до втората цифра след десетични знак.

            //Четрем n което ще бъде броят на числата който ще прочетем след това във for цикъл
            int n = int.Parse(Console.ReadLine());

            //променлива за сбора от числата
            int sum = 0;
            //Правим си променлива за числата които ще четем в цикъла
            int number = 0;

            //правим си цикъла който ще се върти колкото е n
            //вътре четем по едно число и го добавяме към сума всяка врътка
            for (int i = 0; i < n; i++)
            {
                number = int.Parse(Console.ReadLine());
                sum += number;
            }

            //накрая принтираме средно аритметично(сумата/n)
            Console.WriteLine($"{(double)sum / (double)n:f2}");


        }
    }
}
