using System;

namespace Match_Tickets
{
    class Program
    {
        static void Main(string[] args)
        {
            //Когато пуснали билетите за Евро 2016, група запалянковци решили да си закупят.
            //Билетите имат две категории с различни цени:
            //•	VIP – 499.99 лева.
            //•	Normal – 249.99 лева.
            //Запалянковците имат определен бюджет, а броят на хората в групата определя какъв процент от бюджета
            //трябва да се задели за транспорт
            //От 1 до 4 – 75 % от бюджета.
            //•	От 5 до 9 – 60 % от бюджета.
            //•	От 10 до 24 – 50 % от бюджета.
            //•	От 25 до 49 – 40 % от бюджета.
            //•	50 или повече – 25 % от бюджета.
            // Напишете програма, която да пресмята дали с останалите пари от бюджета могат да си купят билети
            // за избраната категория. И колко пари ще им останат или ще са им нужни.
            //Вход
            //Входът се чете от конзолата и съдържа точно 3 реда:
            //•	На първия ред е бюджетът – реално число в интервала[1 000.00... 1 000 000.00]
            //•	На втория ред е категорията – "VIP" или "Normal"
            //•	На третия ред е броят на хората в групата – цяло число в интервала[1... 200]
            //Изход
            //Да се отпечата на конзолата един ред:
            //•	Ако бюджетът е достатъчен:
            //o   "Yes! You have {останалите пари на групата} leva left."
            //•	Ако бюджетът НЕ Е достатъчен:
            //            o   "Not enough money! You need {сумата, която не достига} leva."
            //Сумите трябва да са форматирани с точност до два знака след десетичната запетая.

            //1.Четем от конзолата
            //бюджет
            double budjet = double.Parse(Console.ReadLine());
            //категория билет
            string ticket = Console.ReadLine();
            //брой на хората в групата
            int people = int.Parse(Console.ReadLine());

            //променливи за
            //цена на билет
            double ticketPrice = 0;
            //процент от бюджета за транспорт
            double transportPrice = 0;
            //Общо пари които ще са нужни
            double allMoneyNeeded = 0;

            //2.проверяваме какъв тип е билета и присвояваме към ticketPrice съответната цена
            switch (ticket)
            {
                case "VIP":
                    ticketPrice = 499.99;
                    break;
                case "Normal":
                    ticketPrice = 249.99;
                    break;
            }
            //проверяваме колко хора ще са и присвояваме съотвентните проценти към процент
            //от бюджета след което вадим сумата от бюджета 
            
            if (people < 5)
            {
                transportPrice = budjet * 0.75;
            }
            else if (people < 10)
            {
                transportPrice = budjet * 0.60;
            }
            else if (people < 25)
            {
                transportPrice = budjet * 0.50;
            }
            else if (people < 50)
            {
                transportPrice = budjet * 0.40;
            }
            else 
            {
                transportPrice = budjet * 0.25;
            }
            //умножаваме цената на билета по хората които ще трябва да купят билет, добавяме и цената на транспорта
            //и изваждаме резултата от бюджета

            allMoneyNeeded = ticketPrice * people + transportPrice;


            //3. проверяваме дали бюджета ще е достатъчен и 
            //•	Ако бюджетът е достатъчен:
            //o   "Yes! You have {останалите пари на групата} leva left."
            //•	Ако бюджетът НЕ Е достатъчен:
            //            o   "Not enough money! You need {сумата, която не достига} leva."
            //Сумите трябва да са форматирани с точност до два знака след десетичната запетая.
            if (budjet > allMoneyNeeded)
            {
                Console.WriteLine($"Yes! You have {budjet - allMoneyNeeded:f2} leva left.");
            }
            else 
            {
                Console.WriteLine($"Not enough money! You need {allMoneyNeeded - budjet:f2} leva.");
            }

        }
    }
}
