using System;

namespace MultiplyBy2
{
    class Program
    {
        static void Main(string[] args)
        {
            // Напишете програма, която да умножава положителни числа по 2.
            // От конзолата се четат поредица от реални числа, всяко на нов ред, докато не се въведе отрицателно.
            // След всяко умножено число на нов ред да се отпечата "Result: {резултата от умножението}".
            // Резултата от умножението да бъде форматиран до втория знак след десетичния разделител.
            // При получаване на негативно число, на конзолата да се отпечата "Negative number!" и програмата да приключи изпълнение.

            //1.Четем поредица от реални числа, всяко на нов ред, докато не се въведе отрицателно.
            //четем число и правим while loop докато не се въведе отрицателно
            double number = double.Parse(Console.ReadLine());

            while (number>=0)
            {
                number = number* 2;
                Console.WriteLine($"Result: {number:f2}");
                number = double.Parse(Console.ReadLine());
            }
            //При получаване на негативно число, на конзолата да се отпечата "Negative number!" и програмата да приключи изпълнение.
            //Тоест просто ако е въведено отрицателно число ще излезе от цикъла и ще отпечатаме "Negative number!"
            Console.WriteLine("Negative number!");
        }
    }
}
