using System;

namespace TrainTheTrainers
{
    class Program
    {
        static void Main(string[] args)
        {
            //Курсът "Train the trainers" е към края си и финалното оценяване наближава.
            //Вашата задача е да помогнете на журито което ще оценява презентациите, като напишете програма в която да
            //изчислява средната оценка от представянето на всяка една презентация от даден студент,
            //а накрая средният успех от всички тях.
            //От конзолата на първият ред се прочита броят на хората в журито n - цяло число в интервала[1…20]
            //След това на отделен ред се прочита името на презентацията -текст
            //За всяка една презентация на нов ред се четат n -на брой оценки -реално число в интервала[2.00…6.00]
            //След изчисляване на средната оценка за конкретна презентация, на конзолата се печата
            // "{името на презентацията} - {средна оценка}."
            //След получаване на команда "Finish" на конзолата се печата
            //"Student's final assessment is {среден успех от всички презентации}." и програмата приключва.
            //Всички оценки трябва да бъдат форматирани до втория знак след десетичната запетая.



            //1.четем брой на журито от конзолата

            //създаваме променлива за вход от конзолата, за име на презентация и брояч на на презентациите
            //променлива и за оценка и  сума от всички средни оценки
            int n = int.Parse(Console.ReadLine());
            string input = Console.ReadLine();
            string pressName;
            int pressCount = 0;
            double grade = 0; //оценките за моментата презентация и добавяме към grade//което ще разделим на оценяващите за средната оценка за дадена презентация
            double gradeSum = 0;//сумата на средни оценки 
            //2. създаваме цикъл който да се изпълнява до получване на командата finish като вход от конзолата
            //= вътре в цикъла работим с  входа който е име на презентацията и оценки от журито
            while (input != "Finish")
            {
                //първо присвояваме стойноста на входа към име на презентацията
                pressName = input;
                //нулираме grade за да се използва при всеки for цикъл от 0лева стойност
                grade = 0;
                //след това създаваме for цикъл който да се върти докато всички от журито дадът оценка
                for (int i = 1; i <=n ; i++)
                {

                    //четем оценките за моментата презентация и добавяме към grade//което ще разделим на оценяващите за средната оценка за тази презентация
                    grade += double.Parse(Console.ReadLine());
                    

                }
                //изпечатваме "{името на презентацията} - {средна оценка}."
                Console.WriteLine($"{pressName} - {grade/n:f2}.");
                //добавяме средната оценка за тази презентация към gradeSum//сумата на средни оценки/
                //за да можем да я разделим на презентациите по долу и да получим средна оцценка за всички презентации
                gradeSum += grade / n ;
                //добавяме 1 към брояча на презентации
                pressCount++;
                //и четем нов вход
                input = Console.ReadLine();

            }
            Console.WriteLine($"Student's final assessment is {gradeSum/pressCount:f2}.");

            //4.След като получим командата finish и цикъла спре да се върти отпечатваме //"Student's final assessment is {среден успех от всички презентации}." и програмата приключва.
        }
    }
}
