using System;

namespace GameOfIntervals
{
    class Program
    {
        static void Main(string[] args)
        {
            // Напишете програма, която да пресмята резултата от игра.
            //Първо получавате число, което показва колко хода ще продължи играта.
            //После за всеки ход на играта ще получавате по едно ново число.

            //Според интервала в който попада числото се прибавят точки.Ако числото е отрицателно или по-голямо 50,
            //тогава то е невалидно. В началото на играта резултата е 0 и на всеки ход се прибавят точки по следният начин:

            //точки
            //•	От 0 до 9  20 % от числото
            //•	От 10 до 19  30 % от числото
            //•	От 20 до 29  40 % от числото
            //•	От 30 до 39  50 точки
            //•	От 40 до 50  100 точки
            //•	Невалидно число  резултата се дели на 2


            //Освен резултата програмата трябва да изкарва статистика за проценти числа в дадените интервали.

            //Вход
            //Входът се чете от конзолата:
            //•	Първи ред -колко хода ще има по време на играта – цяло число в интервала[1...100]
            //•	За всеки ход – числата, които се проверяват в кой интервал са – цели числа в интервала[-100...100]
            //Изход
            //Да се отпечата на конзолата 7 реда:
            //•	1ви ред: "{Краен резултат}"
            //•	2ри ред: "From 0 to 9: {процент в интервала}%"
            //•	3ти ред: "From 10 to 19: {процент в интервала}%"
            //•	4ти ред: "From 20 to 29: {процент в интервала}%"
            //•	5ти ред: "From 30 to 39: {процент в интервала}%"
            //•	6ти ред: "From 40 to 50: {процент в интервала}%"
            //•	7ми ред: "Invalid numbers: {процент в интервала}%"
            //Всички числа трябва да са форматирана до вторият знак след запетаята.

            //1.Четем броят на ходовете в играта
            int moves = int.Parse(Console.ReadLine());

            //променливи
            //точки
            double points = 0;
            //броячи за числата в дадени интервали
            int numbers0to9 = 0;
            int numbers10to19 = 0;
            int numbers20to29 = 0;
            int numbers30to39 = 0;
            int numbers40to50 = 0;
            int invalid = 0;

            //2.Четем 	За всеки ход – числата, които се проверяват в кой интервал са – цели числа в интервала[-100...100]
            //правим си променлива за числата които ще четем в цикъл за всеки ход на играта
            int number = 0;
            for (int i = 0; i < moves; i++)
            {
                number = int.Parse(Console.ReadLine());
                //Според интервала в който попада числото се прибавят точки.Ако числото е отрицателно или по-голямо 50,
                //тогава то е невалидно. В началото на играта резултата е 0 и на всеки ход се прибавят точки по следният начин:
                //точки
                //•	От 0 до 9  20 % от числото
                //•	От 10 до 19  30 % от числото
                //•	От 20 до 29  40 % от числото
                //•	От 30 до 39  50 точки
                //•	От 40 до 50  100 точки
                //•	Невалидно число  резултата се дели на 2

                //ако номера е по голям от -1. тоест от 0 нагоре и ако е по малък или равен на 50
                if (number > -1 && number <= 50)
                {

                    //if else if конструкция за съответните интервали
                    if (number < 10)
                    {
                        points += (double)number * 0.20;
                        //добавяме 1 към даденият интервал. за да ползваме статистиката за изчисляване на проценти после
                        numbers0to9++;
                    }
                    else if (number < 20)
                    {
                        points += (double)number * 0.30;
                        numbers10to19++;
                    }
                    else if (number < 30)
                    {
                        points += (double)number * 0.40;
                        numbers20to29++;
                    }
                    else if (number < 40)
                    {
                        points += 50;
                        numbers30to39++;
                    }
                    else if (number <= 50)
                    {
                        points += 100;
                        numbers40to50++;
                    }
                }
                //еse на първият if ако са по малко от 0 или над 50
                else 
                {
                    points = points / 2;
                    invalid++;
                }
            }

            //Освен резултата програмата трябва да изкарва статистика за проценти числа в дадените интервали.
            //Да се отпечата на конзолата 7 реда:
            //•	1ви ред: "{Краен резултат}"
            Console.WriteLine($"{points:f2}");
            //•	2ри ред: "From 0 to 9: {процент в интервала}%" (броят на числата в интервала/всички числа * 100)
            //всички числа са колкото ходове е имало
            Console.WriteLine($"From 0 to 9: {((double)numbers0to9/(double)moves)*100:f2}%");
            //•	3ти ред: "From 10 to 19: {процент в интервала}%"
            Console.WriteLine($"From 10 to 19: {((double)numbers10to19 / (double)moves) * 100:f2}%");
            //•	4ти ред: "From 20 to 29: {процент в интервала}%"
            Console.WriteLine($"From 20 to 29: {((double)numbers20to29 / (double)moves) * 100:f2}%");
            //•	5ти ред: "From 30 to 39: {процент в интервала}%"
            Console.WriteLine($"From 30 to 39: {((double)numbers30to39 / (double)moves) * 100:f2}%");
            //•	6ти ред: "From 40 to 50: {процент в интервала}%"
            Console.WriteLine($"From 40 to 50: {((double)numbers40to50/ (double)moves) * 100:f2}%");
            //•	7ми ред: "Invalid numbers: {процент в интервала}%"
            Console.WriteLine($"Invalid numbers: {((double)invalid/ (double)moves) * 100:f2}%");
            //Всички числа трябва да са форматирана до вторият знак след запетаята.
        }
    }
}
