using System;

namespace SumPrimeNonPrime
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която чете от конзолата цели числа в диапазона, докато не се получи команда "stop".
            //Да се намери сумата на всички въведени прости и сумата на всички въведени непрости числа.
            //Тъй като по дефиниция от математиката отрицателните числа не могат да бъдат прости,
            //ако на входа се подаде отрицателно число да се изведе следното съобщение "Number is negative.".
            //В този случай въведено число се игнорира и не се прибавя към нито една от двете суми,
            //а програмата продължава своето изпълнение, очаквайки въвеждане на следващо число. 
            //На изхода да се отпечатат на два реда двете намерени суми в следния формат:
            //•	"Sum of all prime numbers is: {prime numbers sum}"
            //•	"Sum of all non prime numbers is: {nonprime numbers sum}"


            //създаваме променливи за вход и текущо число
            string input = Console.ReadLine();
            int currentNum = 0;
            //променливи за сумата на простите и не простите числа
            int sumPrime = 0;
            int sumNonPrime = 0;
            //създаваме булева променлива за да проверяваме дали числото е просто или не
            bool isPrime;//     по default  е true
            //1. създаваме цикъл който се изпълнява докато не получим командата stop
            while (input != "stop")
            {

                //=  на текущото число писвояваме стойноста на входа
                currentNum = int.Parse(input);
                //Трябва първаначално да приемаме че числото е просто => isPrime=true
                isPrime = true;
                //= проверяваме дали числото е просто или не 
                //проверката е дали е < 0 тоест негативно  при което извеждаме следното съобщение "Number is negative.". и четем следващо число
                if (currentNum < 0)
                {
                    Console.WriteLine("Number is negative.");
                }
                else 
                {
                    //прости числа са тези които се делят на себе си и 1//разделяме числото на всички числа освен на себе си и на 1
                    //  ако върне остатък 0 значи числото не е просто//тоест ако се раздели някъде без остатък правим булевата isPrime=false. и спираме проверката
                    //попринцип трябва да проверим и дали curentNumber не е 1 тъй като в такъв случай ще разделим 1 на 2 резултата няма да е 0 но 1 не е просто число
                    //но в тази задача няма тест съдъращ едно акто вход
                    for (int i = 2; i < currentNum; i++)
                    {
                        if (currentNum % i == 0)
                        {
                            isPrime = false;
                            break;
                        }
                    }
                }

                //2.Ако числото е просто добавяме го към сумата на простите числа, ако не добавяме го към сумата на не простите числа
                //и дали не е отрицателно
                if (isPrime == true && currentNum >0)
                {
                    sumPrime += currentNum;
                }
                else if(currentNum>0)
                {
                    //проверяваме и дали числото е непросто отрицателно
                    sumNonPrime += currentNum;
                }
                //Четем нов вход от конзолата
                input = Console.ReadLine();
            }

            //3.Отпечатваме резултата на конзолата
            //На изхода да се отпечатат на два реда двете намерени суми в следния формат:
            //•	"Sum of all prime numbers is: {prime numbers sum}"
            //•	"Sum of all non prime numbers is: {nonprime numbers sum}"
            Console.WriteLine($"Sum of all prime numbers is: {sumPrime}");
            Console.WriteLine($"Sum of all non prime numbers is: {sumNonPrime}");

        }
    }
}
