using System;

namespace BonusScore
{
    class Program
    {
        static void Main(string[] args)
        {
            //Дадено е цяло число – начален брой точки.Върху него се начисляват
            //бонус точки по правилата, описани по - долу.Да се напише програма,
            //която пресмята бонус точките, които получава числото и общия брой точки(числото +бонуса).
            //•	Ако числото е до 100 включително, бонус точките са 5.
            //•	Ако числото е по-голямо от 100, бонус точките са 20 % от числото.
            //•	Ако числото е по-голямо от 1000, бонус точките са 10 % от числото.

            //•	Допълнителни бонус точки(начисляват се отделно от предходните):
            // За четно число = +1 т.
            // За число, което завършва на 5 = +2 т.

            //Четем числото от конзолата
            double num = double.Parse(Console.ReadLine());
            double bonus=0.0;
            double extraBonus;

            //пресмята бонус точките, които получава числото и общия брой точки(числото + бонуса).
            //•	Ако числото е до 100 включително, бонус точките са 5.

            if (num <= 100)
            {
                bonus=5;
            }
            //•	Ако числото е по-голямо от 100, бонус точките са 20 % от числото.
            else if (num > 100 & num<=999)
            {
                bonus = num * 0.2;
            }
            //•	Ако числото е по-голямо от 1000, бонус точките са 10 % от числото.
            else if (num > 1000)
            {
                bonus=num * 0.1;
            }


            //•	Допълнителни бонус точки(начисляват се отделно от предходните):
            // За четно число = +1 т.
            // За число, което завършва на 5 = +2 т.
            if (num % 2 == 0)
            {
                bonus= bonus+1;
            }
            else if(num%10==5)
            {
                bonus = bonus + 2;
            }

            //Пресмятаме всичко
            Console.WriteLine(bonus);
            Console.WriteLine(bonus+num);



        }
    }
}
