using System;

namespace Logistic
{
    class Program
    {
        static void Main(string[] args)
        {
            //Отговаряте за логистиката на различни товари. В зависимост от теглото на товара е нужно различно превозно средство.
            //Цената на тон, за която се превозва товара е различна за всяко превозно средство:

            //•	До 3 тона – микробус(200 лева на тон)
            //•	От 4 до 11 тона – камион(175 лева на тон)
            //•	12 и повече тона – влак(120 лева на тон)

            //Вашата задача е да изчислите средната цена на тон превозен товар,
            //както и процента на тоновете превозвани
            //с всяко превозно средство, спрямо общото тегло(в тонове) на всички товари.

            //Вход
            //От конзолата се четат поредица от числа, всяко на отделен ред:
            //•	На първия ред – броя на товарите за превоз – цяло число в интервала[1...1000]
            //•	За всеки един товар на отделен ред – тонажа на товара – цяло число в интервала[1...1000]
            //Изход
            //Да се отпечатат на конзолата 4 реда, както следва:
            //•	Първи ред – средната цена на тон превозен товар(закръглена до втория знак след дес. запетая);
            //•	Втори ред – процентът тона превозвани с микробус(процент между 0.00 % и 100.00 %);
            //•	Трети ред – процентът тона превозвани с камион(процент между 0.00 % и 100.00 %);
            //•	Четвърти ред – процентът тона превозвани с влак(процент между 0.00 % и 100.00 %).

            //1.Четем броят на товарите
            int cargoQnty = int.Parse(Console.ReadLine());

            //други променливи
            //обща цена от всички превозни средства и товари
            double totallPrice = 0;
            //общо тегло в тонове
            int totalWeight = 0;
            // количество превозено с различните типове превоз
            int microbusCargo = 0;
            int truckCargo = 0;
            int trainCargo = 0;
            //средна цена на тон
            double middlePricePerTon = 0;

            //2.Четем За всеки един товар на отделен ред – тонажа на товара – цяло число в интервала[1...1000]
            //Тоест правим цикъл до като не свършат товарите
            //правим си променлива към която ще присвояваме прочетеното в цикъла
            int cargoWeight = 0;
            for (int i = 0; i < cargoQnty; i++)
            {
                cargoWeight = int.Parse(Console.ReadLine());

                //Вашата задача е да изчислите средната цена на тон превозен товар,
                //както и процента на тоновете превозвани
                //с всяко превозно средство, спрямо общото тегло(в тонове) на всички товари.

                //добавяме количеството към съответният тип превоз 
                if (cargoWeight <= 3)
                {
                    //До 3 тона – микробус(200 лева на тон)
                    microbusCargo += cargoWeight;
                    totallPrice += cargoWeight * 200;
                }
                else if (cargoWeight <= 11)
                {
                    //•	От 4 до 11 тона – камион(175 лева на тон)
                    truckCargo += cargoWeight;
                    totallPrice += cargoWeight * 175;
                }
                else
                {
                    //•	12 и повече тона – влак(120 лева на тон)
                    trainCargo += cargoWeight;
                    totallPrice += cargoWeight * 120;
                }
            }

            //изчисляваме общото количество в тонове и разделяме общата цена на тях за да намерим средна цена за тон
            totalWeight = microbusCargo + truckCargo + trainCargo;

            middlePricePerTon = totallPrice / totalWeight;

            //изчисляваме и процент н товар от общият прекаран със всяко ревозно средство (общто товара / тоновете прекарани с даденото средство)


            //Да се отпечатат на конзолата 4 реда, както следва:
            //•	Първи ред – средната цена на тон превозен товар(закръглена до втория знак след дес. запетая);
            Console.WriteLine($"{middlePricePerTon:f2}");
            //•	Втори ред – процентът тона превозвани с микробус(процент между 0.00 % и 100.00 %);
            Console.WriteLine($"{((double)microbusCargo/(double)totalWeight)*100:f2}%");
            //•	Трети ред – процентът тона превозвани с камион(процент между 0.00 % и 100.00 %);
            Console.WriteLine($"{((double)truckCargo / (double)totalWeight) * 100:f2}%");
            //•	Четвърти ред – процентът тона превозвани с влак(процент между 0.00 % и 100.00 %).
            Console.WriteLine($"{((double)trainCargo / (double)totalWeight) * 100:f2}%");
        }
    }
}
