using System;

namespace Flowers
{
    class Program
    {
        static void Main(string[] args)
        {
            //Магазин за цветя предлага 3 вида цветя: хризантеми, рози и лалета.Цените зависят от сезона.

            //Сезон               Хризантеми        Рози              Лалета
            //Пролет / Лято       2.00 лв./ бр.    4.10 лв./ бр.    2.50 лв./ бр.
            //Есен / Зима         3.75 лв./ бр.    4.50 лв./ бр.    4.15 лв./ бр.


            //В празнични дни цените на всички цветя се увеличават с 15 %.
            //
            //Предлагат се следните отстъпки:
            //•	За закупени повече от 7 лалета през пролетта – 5 % от цената на целият букет.
            //•	За закупени 10 или повече рози през зимата – 10 % от цената на целият букет.
            //•	За закупени повече от 20 цветя общо през всички сезони – 20 % от цената на целият букет.
            //Отстъпките се правят по така написания ред и могат да се наслагват!
            //Всички отстъпки важат след оскъпяването за празничен ден!

            //Цената за аранжиране на букета винаги е 2лв.

            //Напишете програма, която изчислява цената за един букет.
            //Вход
            //Входът се чете от конзолата и съдържа точно 5 реда:
            //•	На първия ред е броят на закупените хризантеми – цяло число в интервала[0... 200]
            //•	На втория ред е броят на закупените рози – цяло число в интервала[0... 200]
            //•	На третия ред е броят на закупените лалета – цяло число в интервала[0... 200]
            //•	На четвъртия ред е посочен сезона – [Spring, Summer, Аutumn, Winter]
            //•	На петия ред е посочено дали денят е празник – [Y – да / N - не]
            //Изход
            //Да се отпечата на конзолата 1 число – цената на цветята, форматирана до вторият знак след десетичната запетая.

            //1.Четем от конзолата
            //•	На първия ред е броят на закупените хризантеми – цяло число в интервала[0... 200]
            int hrizantemi = int.Parse(Console.ReadLine());
            //•	На втория ред е броят на закупените рози – цяло число в интервала[0... 200]
            int roses = int.Parse(Console.ReadLine());
            //•	На третия ред е броят на закупените лалета – цяло число в интервала[0... 200]
            int laleta = int.Parse(Console.ReadLine());
            //•	На четвъртия ред е посочен сезона – [Spring, Summer, Аutumn, Winter]
            string season = Console.ReadLine();
            //•	На петия ред е посочено дали денят е празник – [Y – да / N - не]
            string praznik = Console.ReadLine();

            //2.променливи
            //цена хризантеми
            double hrisantemPrice = 0;
            //цена рози
            double rosesPrice = 0;
            //цена лалета
            double lalePrice = 0;

            ///3.Проверяваме какъв е сезона и присвояваме съответната цена за всяко цвете
            if (season == "Spring" || season == "Summer")
            {
                //хризантеми
                hrisantemPrice = 2;
                //рози
                rosesPrice = 4.10;
                //лалета
                lalePrice = 2.50;
            }
            else 
            {
                //хризантеми
                hrisantemPrice = 3.75;
                //рози
                rosesPrice = 4.50;
                //лалета
                lalePrice = 4.15;
            }



            //5.Калкулираме общата цена
            double totall = (hrisantemPrice * hrizantemi + rosesPrice * roses + lalePrice * laleta);

            //4.проверяваме дали е прзничен ден и ако е увеличаваме ценata с 15%
            if (praznik == "Y")
            {
                totall += totall * 0.15;
            }

            //6.проверяваме дали е пролет и дали лалета са повече от 7 и намаляваме цената на целият букет с 5%
            if (season== "Spring" && laleta>=7)
            {
                totall -= totall * 0.05;
            }
            //7. проверява дали е зима и дали розите са повече от 10 и намаляваме цената на целият букет с 10%
            if (season== "Winter"&&roses>=10)
            {
                totall -= totall * 0.10;
            }
            //8. проверяваме дали общо цветята са повече от 20 и намаляваме цената на целият букет с 20%
            if (roses+laleta+hrizantemi>20)
            {
                totall -= totall * 0.20;
            }
            //9. //Изход
            //Да се отпечата на конзолата 1 число – цената на цветята + 2 lv za аранжиране, форматирана до вторият знак след десетичната запетая.
            Console.WriteLine($"{totall+2:f2}");


        }
    }
}
