using System;

namespace Hospital
{
    class Program
    {
        static void Main(string[] args)
        {
            //За даден период от време, всеки ден в болницата пристигат пациенти за преглед.

            //Тя разполага първоначално със 7 лекари.Всеки лекар може да преглежда само по един пациент на ден,
            //но понякога има недостиг на лекари, затова останалите пациенти се изпращат в други болници.

            //Всеки трети ден, болницата прави изчисления и ако броят на непрегледаните пациенти е
            //по - голям от броя на прегледаните, се назначава още един лекар.

            //Като назначаването става преди да започне приемът на пациенти за деня.

            //Напишете програма, която изчислява за дадения период броя на прегледаните и непрегледаните пациенти.

            //Вход
            //Входът се чете от конзолата и съдържа:
            //•	На първия ред – периода, за който трябва да направите изчисления. Цяло число в интервала[1... 1000]
            //•	На следващите редове(равни на броят на дните) – броя пациенти, които пристигат за преглед за текущия ден. Цяло число в интервала[0…10 000]
            //Изход
            //Да се отпечатат на конзолата 2 реда:
            //•	На първия ред: "Treated patients: {брой прегледани пациенти}."
            //•	На втория ред: "Untreated patients: {брой непрегледани пациенти}."

            //1. Четем от конзолата
            //•	На първия ред – периода, (Дни, като на всеки 3ти ден се прави изчеслението) за който трябва да направите изчисления. Цяло число в интервала[1... 1000]
            int period = int.Parse(Console.ReadLine());

            //променливи
            //брой лекари = начални 7

            int doctors = 7;
            //брояч за прегледани пациенти
            int takenPatients=0;
            //брояч за непрегледани пациенти
            int missedPatients=0;


            //2. Четем  
            //•	На следващите редове(равни на броят на дните) – броя пациенти, които пристигат за преглед за текущия ден. Цяло число в интервала[0…10 000]
            //правим променлива за броят пациенти които ще влезнат и цикъл където четем и присвояваме броят на пациентите към тази променлива
            //докато дните не свършат
            int incomingPatients = 0;
            for (int i = 1; i <= period; i++)
            {
                incomingPatients = int.Parse(Console.ReadLine());
                //Всеки трети ден, болницата прави изчисления и ако броят на непрегледаните пациенти е
                //по - голям от броя на прегледаните, се назначава още един лекар.
                //Като назначаването става преди да започне приемът на пациенти за деня.
                if (i % 3 == 0)
                {
                    if (missedPatients > takenPatients)
                    {
                        doctors++;
                    }
                }
                //7 лекари.Всеки лекар може да преглежда само по един пациент на ден,
                //но понякога има недостиг на лекари, затова останалите пациенти се изпращат в други болници.

                //3. Правим проверка, ако дошлите пациенти са повече от 7(или колкото са докторите, ако сме ги увеличили след изчисленията на третият ден)
                //и добавяме остатъка към missedPatiens а прегледаните към takenPatients
                if (incomingPatients > doctors)
                {
                    //в случаят не прегледаните ще са остатъка от влезлите минус докторите,
                    //а прегледаните пациенти ще са колкото докторите. 
                    missedPatients += incomingPatients - doctors;
                    takenPatients += doctors;

                }
                else 
                {
                    //ако дошлите пациенти не са повече от докторите просто ги добавяме към takenPatients
                    takenPatients += incomingPatients;
                }
 
            }

            //Изход
            //Да се отпечатат на конзолата 2 реда:
            //•	На първия ред: "Treated patients: {брой прегледани пациенти}."
            //•	На втория ред: "Untreated patients: {брой непрегледани пациенти}."

            Console.WriteLine($"Treated patients: {takenPatients}.");
            Console.WriteLine($"Untreated patients: {missedPatients}.");
        }
    }
}
