using System;

namespace Steps
{
    class Program
    {
        static void Main(string[] args)
        {
            //Габи иска да започне здравословен начин на живот и си е поставила за цел да върви 10 000 стъпки всеки ден.
            //Някои дни обаче е много уморена от работа и ще иска да се прибере преди да постигне целта си.
            //Напишете програма, която чете от конзолата по колко стъпки изминава тя всеки път като излиза през деня и
            //когато постигне целта си да се изписва "Goal reached! Good job!"  и колко стъпки повече е извървяла
            //"{разликата между стъпките} steps over the goal!"
            //Ако иска да се прибере преди това, тя ще въведе командата "Going home" и ще въведе стъпките,
            //които е извървяла докато се прибира.След което, ако не е успяла да постигне целта си,
            //на конзолата трябва да се изпише: "{разликата между стъпките} more steps to reach goal."

            //1. променливи за стъпките и за входа от конзолата който ще ползваме в шхиле цикъла
            int allSteps = 0;
                string input;

            //3.. правим цикъл за всяко излизане

            while (allSteps < 10000)
            {
                //четем вход от конзолата
                input = Console.ReadLine();

                //проверяваме дали входът са стъпки или съобщението going home
                //Ако е въведена команда "Going home" ще въведе стъпките,
                //които е извървяла докато се прибира и трябва да ги прибавим към другите
                //ако не преобразуваме стъпките в число и го прибавяме към другите
                if (input == "Going home")
                {
                    ///въвежда стъпките,
                    //които е извървяла докато се прибира и трябва да ги прибавим към другите
                    allSteps += int.Parse(Console.ReadLine());
                    break;


                }
                else
                {
                    allSteps += int.Parse(input);
                    //ако не преобразуваме стъпките в число и го прибавяме към другите
                }

            }


            //4. ако стъпките са равни или надвишават 10 000 се изписва "Goal reached! Good job!"  и колко стъпки повече е извървяла
            //"{разликата между стъпките} steps over the goal!"
            //Ако е въведена команда "Going home" ще въведе стъпките,
            //които е извървяла докато се прибира.След което, ако стъпките извървени до сега и стъпките докато се пребира
            //не са достатъчни за да постигне целта си,
            //на конзолата трябва да се изпише: "{разликата между стъпките} more steps to reach goal."
            if (allSteps >= 10000)
            {
                Console.WriteLine($"Goal reached! Good job!");
                Console.WriteLine($"{allSteps - 10000} steps over the goal!");
            }
            else 
            {
                Console.WriteLine($"{10000 - allSteps} more steps to reach goal.");
            }

        }
    }
}
