using System;

namespace Clock
{
    class Program
    {
        static void Main(string[] args)
        {
            ////Напишете програма, която отпечатва часовете в денонощието от 0:0 до 23:59, всеки на отделен ред. 
            ///Часовете трябва да се изписват във формат "{час}:{минути}".
            ///

            //int min = 59;
            //int hour = 23;
            //int minClock;
            //int hourClock;

            ///Първият цикъл сравнява h(чаовете) с 23 и докато е по малко или равно увеличава h 
            ///започва да се върти като в него е вторият цикъл който е до 59
            ///така е 0 часа докато вторият цикъл не стигне 59 след това се връща на първият и часовете стават 1 и това се повтаря докато часовете не станат 23:59
            ///
            for (int h = 0; h <=23 ; h++)
            {
                //hourClock = h;

                ///вторият цикъл сравнява м(минутите) с 59 и докато е по малко или равно увеличава м 
                for (int m = 0; m <= 59; m++)
                {
                    ///minClock = m;
                    //Console.WriteLine($"{hourClock}:{minClock}");
                    Console.WriteLine($"{h}:{m}");
                }


            }
        }
    }
}
