using System;

namespace Graduation
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която изчислява средната оценка на ученик от цялото му обучение.
            //На първия ред ще получите името на ученика, а на всеки следващ ред неговите годишни оценки.
            //Ученикът преминава в следващия клас, ако годишната му оценка е по-голяма или равна на 4.00.

            //Ако ученикът бъде скъсан повече от един път, то той бива изключен и програмата приключва,
            //като се отпечатва името на ученика и в кой клас бива изключен.
            //            При успешно завършване на 12 - ти клас да се отпечата : 
            //"{име на ученика} graduated. Average grade: {средната оценка от цялото обучение}"
            //В случай, че ученикът е изключен от училище, да се отпечата:
            //            "{име на ученика} has been excluded at {класа, в който е бил изключен} grade"
            //Стойността трябва да бъде форматирана до втория знак след десетичната запетая.

            ////Четем името на ученика
            string name = Console.ReadLine();

            ///Правим си променливи за година повторения на класа и сума от оценките
            int year = 1;
            int repetition = 0;
            double gradesSum = 0;

            ///Докато годината е по малка от 12
            while (year <= 12)
            {
                ///четем оценка за настоящата година
                double currentYearGrade = double.Parse(Console.ReadLine());

                ///ако оценката е по малка или равна на 4 добавяме 1 към повторени класове
                if (currentYearGrade <4)
                {
                    repetition++;
                    ////ако повторените класове са повече от 1 програмата приключва
                    if (repetition>1)
                    {
                        break;
                    }
                    ///ако не цикъла се завърта пак
                    continue;
                }
                /// след проверките уценката за текущата година се добавя към общ брой и се добавя 
                /// година(тоест ученика преминава към следващ калас) ако програмата не приключи
                gradesSum += currentYearGrade;
                year++;
            }


            //проверяваме дали има повче от един повторен клас и е изключен или завършва
            if (repetition>1)
            {
                //excluded

                Console.WriteLine($"{name} has been excluded at {year} grade");
            }
            else
            {
                //graduated

                double avarageGrade = gradesSum / ( year-1);
                Console.WriteLine($"{name} graduated. Average grade: {avarageGrade:f2}");
            }


        }
    }
}
