using System;

namespace Challenge_the_Wedding
{
    class Program
    {
        static void Main(string[] args)
        {
            //Провокирани от сватбата си, Михаела и Иван решават да предоставят нова услуга на клиенти на ресторанта си,
            //а именно вечеря за запознанства -"Предизвикай Сватбата".

            //Напишете програма, която отпечатва всички възможни срещи на клиентите на ресторанта.

            //При настаняване всеки мъж и всяка жена получават талончета с поредни номера стартирайки от 1.
            //Ако бъдат заети всички маси, програмата трябва да приключи.Всяка маса има две места.

            //Вход
            //От конзолата се четат точно 3 числа, всяко на отделен ред:
            //•	Броя клиенти мъже - цяло число в интервала[1...100]
            //•	Броя клиенти жени - цяло число в интервала[1...100]
            //•	Максималният брой маси - цяло число в интервала[1...100]
            //Изход
            //На конзолата се принтират на един ред, разделени с интервал всички срещи в следният формат:
            //•	({№ клиент} <-> {№ клиент}) ({№ клиент} <-> {№ клиент}) ...

            //1.Четем 
            //•	Броя клиенти мъже - цяло число в интервала[1...100]
            int mens = int.Parse(Console.ReadLine());
            //•	Броя клиенти жени - цяло число в интервала[1...100]
            int womens = int.Parse(Console.ReadLine());
            //•	Максималният брой маси - цяло число в интервала[1...100]
            //като мисля според дадените вход и изход че масите всъщност са максимален брой комбинации комбинации
            int tables = int.Parse(Console.ReadLine());

            //променливи
            //ако масите всъщност са максимален брой комбинации си правим брояч за всяка комбинация
            int combinationsTables = 0;
            

            //2. правим си цикъл който да се върти докато всички не са седнали
            //или ако масите свършат програмата приключва
            //един for цикъл за мъже и един вътрешен за жени докато не свършат. при всяко завъртане(настаняване) им
            //даваме билетче(увеличваме int с 1) и пишем комбинации и добавяме 1 към брояча на комбинации(маси)
            //ако комбинациите са по малко от брояча си  пишем комбинации и въртим ако не спираме 


                //При настаняване всеки мъж и всяка жена получават талончета с поредни номера стартирайки от 1.
                for (int menTicket = 1; menTicket <= mens; menTicket++)
                {
                        for (int womenTicket = 1; womenTicket <=womens ; womenTicket++)
                        {
                            if (combinationsTables < tables)
                            {
                              //На конзолата се принтират на един ред, разделени с интервал всички срещи в следният формат:
                              //•	({№ клиент} <-> {№ клиент}) ({№ клиент} <-> {№ клиент}) ...
                               Console.Write($"({menTicket} <-> {womenTicket}) ");
                                combinationsTables++;
                            }
                            else
                            {
                            break;
                            }
                        }

                     if (combinationsTables < tables)
                     {
                         continue;
                    
                     }
                     else
                     {
                         break;
                     }

                }

            

        }
    }
}
