using System;

namespace SumSeconds
{
    class Program
    {
        static void Main(string[] args)
        {
            //Трима спортни състезатели финишират за някакъв брой секунди (между 1 и 50).
            //Да се напише програма, която чете времената на състезателите в секунди,
            //въведени от потребителя и пресмята сумарното им време във формат "минути:секунди".
            //Секундите да се изведат с водеща нула (2 = "02", 7 = "07", 35 = "35"). 

            // Трима спортни състезатели.. чете времената на състезателите в секунди

            int racer1 = int.Parse(Console.ReadLine());
            int racer2 = int.Parse(Console.ReadLine());
            int racer3 = int.Parse(Console.ReadLine());

            // пресмята сумарното им време във формат "минути:секунди"
            int timesum = racer1 + racer2 + racer3;
            // пресмятаме колко минути и секунди е сумата от трите времена
            //Делим цялостно на 60(Затова в случаят е важно променливите да са int)
            int min = timesum / 60;//Tова ще даде цяло число без осатъка което
                                   //ще ни даде минутите(110/60=1минута)без остатъка от 50
                                   //което биха били секундите
            int seconds = timesum % 60;//% Модулното деление от друга стра ни дава остатъка
                                       //(110%60=50)което биха били секундите


            //Секундите да се изведат с водеща нула(2 = "02", 7 = "07", 35 = "35").
            //Трябва да проверим за секундите и ако те са от 1 до 9 да ги искараме като 01-09

            if (seconds < 10)
            {
                Console.WriteLine($"{min}:0{seconds}");
            }
            else
                Console.WriteLine($"{min}:{seconds}");

        }
    }
}
