using System;

namespace Vacation
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която спрямо даден бюджет и сезон да пресмята цената, локацията и мястото
            //на настаняване за ваканция. Сезоните са лято и зима – "Summer" и "Winter".Локациите са – "Alaska" и "Morocco".

            //Възможните места за настаняване – "Hotel", "Hut" или "Camp".

            //•	При бюджет по - малък или равен от 1000лв.:
            //o Настаняване в "Camp"
            //o Според сезона локацията ще е една от следните и ще струва определен процент от бюджета:
            //	Лято – Аляска – 65 % от бюджета
            //	Зима – Мароко – 45 % от бюджета

            //•	При бюджет по - голям от 1000лв.и по-малък или равен от 3000лв.:
            //o Настаняване в "Hut"
            //o Според сезона локацията ще е една от следните и ще струва определен процент от бюджета:
            //	Лято – Аляска – 80 % от бюджета
            //	Зима – Мароко – 60 % от бюджета

            //•	При бюджет по - голям от 3000лв.:
            //o Настаняване в "Hotel"
            //o Според сезона локацията ще е една от следните и ще струва 90 % от бюджета:
            //	Лято – Аляска
            //	Зима – Мароко

            //Вход
            //Входът се чете от конзолата и се състои от два реда:
            //•	Първи ред – Бюджет – реално число в интервала[10.00...10000.00]
            //•	Втори ред –  Сезон – текст "Summer" или "Winter"
            //Изход
            //На конзолата трябва да се отпечатат един ред.
            //"{локацията} – {мястото за настаняване} – {цената}"
            //Цената трябва да е форматирана до вторият знак след десетичната запетая.

            //1.Четем от конзолата 
            //•	Първи ред – Бюджет – реално число в интервала[10.00...10000.00]
            double budjet = double.Parse(Console.ReadLine());
            //•	Втори ред –  Сезон – текст "Summer" или "Winter"
            string season = Console.ReadLine();

            //Променливи
            //тип настаняване
            string acomondation = "";
            //локация
            string location = "";
            //цена
            double price = 0;

            //проверяваме бюжета и според него присвояваме съответните стойности към променливите

            if (budjet <= 1000)
            {
                //•	При бюджет по - малък или равен от 1000лв.:
                //o Настаняване в "Camp"
                acomondation = "Camp";
                //o Според сезона локацията ще е една от следните и ще струва определен процент от бюджета:
                //	Лято – Аляска – 65 % от бюджета
                //	Зима – Мароко – 45 % от бюджета
                if (season == "Summer")
                {
                    location = "Alaska";
                    price += budjet * 0.65;
                }
                else
                {
                    location = "Morocco";
                    price += budjet * 0.45;
                }
            }
            else if (budjet > 1000 && budjet <= 3000)
            {
                //•	При бюджет по - голям от 1000лв.и по-малък или равен от 3000лв.:
                //o Настаняване в "Hut"
                acomondation = "Hut";
                //o Според сезона локацията ще е една от следните и ще струва определен процент от бюджета:
                //	Лято – Аляска – 80 % от бюджета
                //	Зима – Мароко – 60 % от бюджета
                if (season == "Summer")
                {
                    location = "Alaska";
                    price += budjet * 0.80;
                }
                else
                {
                    location = "Morocco";
                    price += budjet * 0.60;
                }
            }
            else 
            {
                //•	При бюджет по - голям от 3000лв.:
                //o Настаняване в "Hotel"
                acomondation = "Hotel";
                //o Според сезона локацията ще е една от следните и ще струва 90 % от бюджета:
                //	Лято – Аляска
                //	Зима – Мароко
                if (season == "Summer")
                {
                    location = "Alaska";
                    price += budjet * 0.90;
                }
                else
                {
                    location = "Morocco";
                    price += budjet * 0.90;
                }
            }

            //Изход
            //На конзолата трябва да се отпечатат един ред.
            //"{локацията} – {мястото за настаняване} – {цената}"
            //Цената трябва да е форматирана до вторият знак след десетичната запетая.
            Console.WriteLine($"{location} - {acomondation} - {price:f2}");

        }
    }
}
