using System;

namespace Wedding_Seats
{
    class Program
    {
        static void Main(string[] args)
        {
            //Младоженците искат да направят списък кой на кое място ще седи на сватбената церемония.

            //Местата са разделени на различни сектори. Секторите са главните латински букви като започват от A.
            //Във всеки сектор има определен брой редове.

            //От конзолата се чете броят на редовете в първия сектор(A),
            //като във всеки следващ сектор редовете се увеличават с 1.

            //На всеки ред има определен брой места -тяхната номерация е представена с малките латински букви.

            //Броя на местата на нечетните редове се прочита от конзолата, а на четните редове местата са с 2 повече.

            //Вход
            //От конзолата се четaт 3 реда:
            //•	Последния сектор от секторите -символ(B - Z)
            //•	Броят на редовете в първия сектор -цяло число(1 - 100)
            //•	Броят на местата на нечетен ред -цяло число(1 - 24)


            //Изход
            //Да се отпечата на конзолата всяко място на отделен ред по следния формат:
            //{ сектор}
            //{ ред}
            //{ място}
            //Накрая трябва да отпечата броя на всички места.

            //1. Четем от конзолата
            //•	Последния сектор от секторите -символ(B - Z)
            char lastsector = char.Parse(Console.ReadLine());
            //•	Броят на редовете в първия сектор -цяло число(1 - 100)
            int firstSectorRows = int.Parse(Console.ReadLine());
            //•	Броят на местата на нечетен ред -цяло число(1 - 24)
            int seatsOddRows = int.Parse(Console.ReadLine());


            //променливи
            //променлива за места за да ги променяме при четни редове, а по начало ще я нагласим на броят на нечетните
            int seatsPerRows = seatsOddRows;
            //променлива char за да ползвам АSKII таблицата за местата
            char symbolSeats = 'a';
            //поменлива- брояч на всички места
            int allSeats = 0;


            //Местата са разделени на различни сектори. Секторите са главните латински букви като започват от A.
            //Във всеки сектор има определен брой редове.

            //От конзолата се чете броят на редовете в първия сектор(A),
            //като във всеки следващ сектор редовете се увеличават с 1.

            //На всеки ред има определен брой места -тяхната номерация е представена с малките латински букви.

            //Броя на местата на нечетните редове се прочита от конзолата, а на четните редове местата са с 2 повече.

            ///2. първи цикъл започващ от първият сектор А и завършващ на последният сектор (главна буква char lastsector)

            for (int firstSector = 'A'; firstSector <= lastsector; firstSector++)
            {
                //ВТОРИ ЦИКЪЛ ЗА РЕДОВЕТЕ В СЕКТОР
                for (int rows = 1; rows <= firstSectorRows; rows++)
                {
                    //ТРЕТИ ЦИКЪЛ ЗА МЕСТА КАТО НА ИЗЛИЗАНЕ ОТ ЦИКЪЛА ТРЯБВА ДА УВЕЛИЧИМ РЕДОВЕТЕ В СЕКТОРА С 1
                    //като във всеки следващ сектор редовете се увеличават с 1.

                    //Броя на местата на нечетните редове се прочита от конзолата, а на четните редове местата са с 2 повече.
                    //проверяваме и правим местата на четни редове 2 повече от местата на не четни.
                    //първоначално сме записали seatsEvenRows равни на seatsOddRows
                    //ако редовете са четни правим seatsPerRows +2 ако не ги връщаме на колкот са си нечетните
                    // в случаят просто променям променлива която съм създал (seatsPerRows) при проверката за да я ползвам в долният цикъл
                    if (rows % 2 == 0)
                    {
                        seatsPerRows += 2;
                    }
                    else 
                    {
                        seatsPerRows = seatsOddRows;
                    }
                    for (int seats = 1; seats <= seatsPerRows; seats++)
                    {
                        //Това е,
                        //МЕСТАТА ОБАЧЕ СЕ OТРАЗЯВАТ С МАЛКИ БУКВИ ЗАПОЧВАЩИ ОТ (a)??? как?
                        //някъде ще направя променлива започваща от АSKII номера за малка буква (а) и ще го увеличвам при всяко завъртане на този цикъл
                        //и ще изписвам букваа за място
                        //увеличаваме и брояча на всички места за да го изпечатим след свършването на всички цикли
                        allSeats++;
                        Console.WriteLine($"{(char)firstSector}{rows}{symbolSeats}");
                        //увеличаваме char symbolSeats с 1 за да стане от (а) на (b) при следващотот завъртане
                        symbolSeats++;
                    }
                    //когато цикъла за местата свърши рестартираме symbolSeats към (а)
                    symbolSeats = 'a';

                }
                //като във всеки следващ сектор редовете се увеличават с 1.
                firstSectorRows++;

            }
            Console.WriteLine(allSeats);

        }
    }
}
