using System;

namespace FishingBoat
{
    class Program
    {
        static void Main(string[] args)
        {
            //Тони и приятели много обичали да ходят за риба, те са толкова запалени по риболова, че решават да отидат
            //на риболов с кораб.Цената за наема на кораба зависи от сезона и броя рибари.
            //Цената зависи от сезона:

            //•	Цената за наем на кораба през пролетта е  3000 лв.
            //•	Цената за наем на кораба през лятото и есента е  4200 лв.
            //•	Цената за наем на кораба през зимата е  2600 лв.
            //В зависимост от броя си групата ползва отстъпка:
            //•	Ако групата е до 6 човека включително  –  отстъпка от 10 %.
            //•	Ако групата е от 7 до 11 човека включително  –  отстъпка от 15 %.
            //•	Ако групата е от 12 нагоре  –  отстъпка от 25 %.

            //Рибарите ползват допълнително 5 % отстъпка, ако са четен брой освен ако не е есен -
            //тогава нямат допълнителна отстъпка, която се начислява след като се приспадне отстъпката по горните критерии.
            // Напишете програма, която да пресмята дали рибарите ще съберат достатъчно пари. 


            //Вход
            //От конзолата се четат точно три реда.
            //•	Бюджет на групата – цяло число в интервала[1…8000]
            int budjet = int.Parse(Console.ReadLine());
            //•	Сезон –  текст: "Spring", "Summer", "Autumn", "Winter"
            string season = Console.ReadLine();
//•	Брой рибари – цяло число в интервала[4…18]
int fishers = int.Parse(Console.ReadLine());
            //променлива за наем
            double rent = 0.00;

            //проверяваме какъв е сезона/съответно какъв е наема
            //пролетта е  3000 лв.
            //    лятото и есента е  4200 лв
            //    зимата е  2600 лв
            switch (season) 
            {
                case "Spring":
                    rent = 3000;
                    break;
                case "Summer":
                case "Autumn":
                    rent = 4200;
                    break;
                case "Winter":
                    rent = 2600;
                    break;
            }
            //Проверяваме и какъв е броят на групата/съответно каква е отстъпката
            //•	Ако групата е до 6 човека включително  –  отстъпка от 10 %.
            //•	Ако групата е от 7 до 11 човека включително  –  отстъпка от 15 %.
            //•	Ако групата е от 12 нагоре  –  отстъпка от 25 %.

            //Aко групата е от <=6 ще влезе в първият if, ако е повече ще продължи на долу,
            //където ако <=11 ще влезе, а ако е повече ще слезе към elsa
            if (fishers <= 6)
            {
                rent -= rent * 0.10;
            }
            else if (fishers <= 11)
            {
                rent -= rent * 0.15;
            }
            else 
            {
                rent -= rent * 0.25;
            }

            //ако броят е четен изваждаме 5% освен ако не е есен, след като вече сме извадили другите отстъпки
            if (fishers % 2 == 0 && season != "Autumn") 
            {
                rent -= rent * 0.05;
            }
            // ПРОВЕРЯВАМЕ ДАЛИ БЧДЖЕТА ЩЕ СТИГНЕ
            if (budjet >= rent)
            {
                Console.WriteLine($"Yes! You have {budjet - rent:f2} leva left.");
            }
            else 
            {
                Console.WriteLine($"Not enough money! You need {rent-budjet:f2} leva.");
            }

            //Изход
            //Да се отпечата на конзолата един ред:
            //•	Ако бюджетът е достатъчен:
            //"Yes! You have {останалите пари} leva left."
            //•	Ако бюджетът НЕ Е достатъчен:
            //            "Not enough money! You need {сумата, която не достига} leva."
            //Сумите трябва да са форматирани с точност до два знака след десетичната запетая.

        }
    }
}
