using System;

namespace DishWasher
{
    class Program
    {
        static void Main(string[] args)
        {
            //Гошо работи в ресторант и отговаря за зареждането на съдомиялната накрая на деня.

            //Вашата задача е да напишете програма, която изчислява, дали дадено закупено количество
            //бутилки от препарат за съдомиялна е достатъчно, за да измие определено количество съдове.

            //Знае се, че всяка бутилка съдържа 750 мл.препарат, за 1 чиния са нужни 5 мл.,
            //а за тенджера 15 мл.

            //Приемете, че на всяко трето зареждане със съдове, съдомиялната се пълни само с тенджери,
            //а останалите пъти с чинии.
            //Докато не получите команда "End" ще продължите да получавате бройка съдове, които трябва да бъдат измити.

            //Вход
            //От конзолата се четат:
            //•	Брой бутилки от препарат, който ще бъде използван за миенето на чинии - цяло число в интервала[1…10]
            //На всеки следващ ред, до получаване на командата "End" или докато количеството препарат не се изчерпи, брой съдове, които трябва да бъдат измити -цяло число в интервала[1…100]
            //Изход
            //В случай, че количеството препарат е било достатъчно за измиването на съдовете:
            //"Detergent was enough!"
            //"{брой чисти чинии} dishes and {брой чисти тенджери} pots were washed."
            //"Leftover detergent {количество останал препарат} ml."
            //В случай, че количеството препарат не е било достатъчно за измиването на съдовете:
            //"Not enough detergent, {количество не достигнал препарат} ml. more necessary!"

            //променливи
            //броячи за чинии и тенджери
            int dishes = 0;
            int pots = 0;
            //количество препарат
            int detergetMls = 0;
            //изразохдвано количество
            int detergenTaken = 0;
            //врътки на цикъла
            int cicles = 0;

            //1. Четем Брой бутилки от препарат, който ще бъде използван за миенето на чинии - цяло число в интервала
            int detergentBtls = int.Parse(Console.ReadLine());

            //2.//Знае се, че всяка бутилка съдържа 750 мл.препарат, 
            //първо ще напълним количеството препарат спрямо бутилките  за да проверяваме дали е свършило в цикъла
            detergetMls = detergentBtls * 750;

            //3. //На всеки следващ ред, до получаване на командата "End" или докато количеството препарат не се изчерпи,
            //брой съдове, които трябва да бъдат измити -цяло число в интервала[1…100]
            //правим променлива от тип стринг защото се очаква в даден момент да прочетем командата End
            //вътре в цикъла обаче правим променлива от тип интиджър и присвояваме стойноста на string като парсваме към int
            //на краят на цикъла четем пак stringa като string
            string input = Console.ReadLine();

            while (input!="End")
            {
                //присвояваме прочетеното и го парсваме към инт
                int items = int.Parse(input);
                //ще ползваме брояча за врътките на цикъла за да ползваме когато е на третата да знаем че са тенджери
                cicles++;

                //до получаване на командата "End" или докато количеството препарат не се изчерпи,
                //Знае се, че  за 1 чиния са нужни 5 мл.,
                //а за тенджера 15 мл.


               
                    //Приемете, че на всяко трето зареждане със съдове, съдомиялната се пълни само с тенджери,
                    //а останалите пъти с чинии.
                    if (cicles % 3 == 0)
                    {

                        //тенжери
                        //прибавяме към количеството използван препарат  тенжерите по 15мл за всяка
                        detergenTaken += items * 15;
                        //добавяме измитите тенджери към брояча за измити тенджери
                        pots += items;
                    }
                    else
                    {
                        //чинии.//прибавяме към количеството използван препарат чиниите по 5мл за всяка
                        detergenTaken += items * 5;
                        //добавяме измитите чинии към брояча за измити чинии
                        dishes += items;
                    }

               // въртим до End или докато количеството препарат не се изчерпи,
                //така че проверяваме дали използваното не е повече от наличното, ако не е четем пак 
                //ако да ще прекъснем цикъла
                if (detergenTaken <= detergetMls)
                {
                    //Четем ново количество съдове
                    input = Console.ReadLine();

                }

                else
                {
                    break;
                }

            }
            //В случай, че количеството препарат е било достатъчно за измиването на съдовете:
            //"Detergent was enough!"
            //"{брой чисти чинии} dishes and {брой чисти тенджери} pots were washed."
            //"Leftover detergent {количество останал препарат} ml."
            if (detergetMls >= detergenTaken)
            {
                Console.WriteLine("Detergent was enough!");
                Console.WriteLine($"{dishes} dishes and {pots} pots were washed.");
                Console.WriteLine($"Leftover detergent {detergetMls - detergenTaken} ml.");
            }
            else 
            {
                //В случай, че количеството препарат не е било достатъчно за измиването на съдовете:
                //"Not enough detergent, {количество не достигнал препарат} ml. more necessary!"
                Console.WriteLine($"Not enough detergent, {detergenTaken-detergetMls} ml. more necessary!");
            }





        }
    }
}
