using System;

namespace Unique_PIN_Codes
{
    class Program
    {
        static void Main(string[] args)
        {
            //Да се напише програма, която генерира трицифрени PIN кодове, като цифрите на всеки PIN код са в определен интервал.

            //За да бъде валиден един PIN код той трябва да отговаря на следните условия:
            //•	Първата и третата цифра трябва да бъдат четни.
            //•	Втората цифра трябва да бъде просто число в диапазона[2...7].

            //Вход
            //От конзолата се четат 3 реда:
            //•	Горната граница на първото число - цяло число в диапазона[1...9]
            //•	Горната граница на второто число - цяло число в диапазона[1...9]
            //•	Горната граница на третото число - цяло число в диапазона[1...9]
            //Изход
            //Да се отпечатат на конзолата всички валидни трицифрени PIN кодове, чиито цифри отговарят на съответните интервали.

            //1.Четем границите на пин кода
            //•	Горната граница на първото число - цяло число в диапазона[1...9]
            int firstNumMax = int.Parse(Console.ReadLine());
            //•	Горната граница на второто число - цяло число в диапазона[1...9]
            int secondNumMax = int.Parse(Console.ReadLine());
            //•	Горната граница на третото число - цяло число в диапазона[1...9]
            int thirdNumMax = int.Parse(Console.ReadLine());

            //променливи 
            //булева за да проверявваме дали второто число е просто
            bool isPrime = true;

            //2. правим цикъл за първото число с два вложени цикли за другите 2 за да имаме всички комбинации от 3те числа
            //111,112,113,..119. 121,122,123,..129,.,..199. 211,212,..219. 221,222,223,..229,...,...299., и така до 999
            //като в последният цикъл печатим
            //след проверка на условията

            for (int n1 = 1; n1 <= firstNumMax; n1++)
            {
                for (int n2 = 1; n2 <= secondNumMax; n2++)
                {
                    for (int n3 = 1; n3 <= thirdNumMax; n3++)
                    {
                        //За да бъде валиден един PIN код той трябва да отговаря на следните условия:
                        //•	Първата и третата цифра трябва да бъдат четни.
                        //•	Втората цифра трябва да бъде просто число в диапазона[2...7].( прости числа са: 2, 3, 5, 7)

                        //прости числа са тези които се делят само на себе си и 1 без остатък
                        //разделяме числото на всички числа освен на себе си и на 1 (цикъл който да върти от 2 до даденото число -1)
                        //тъй като не делим на 1 на самото число и няма смисъл да делим на число по голямо от даденото тъй като ще даде 0.нещо
                        //ако върне остатък 0 значи числото не е просто//тоест ако се раздели някъде без остатък правим булевата isPrime=false.
                        //и спираме цикъла за да избегне напимер номера да е 4 и след като сме разбрали при 4/2 че е просто да стигнем до 4/3 и да получим 0.5 и да загубим функциалноста

                        for (int i = 2; i < n2; i++)
                        {
                            if (n2 % i == 0)
                            {
                                isPrime = false;
                                break;
                            }

                        }

                        //проверяваме дали n1 и n3 са четни. И дали n2 не е 1(тъй като при проверката за просто число 1/2 дава 0.5)
                        //и го брои за просто като не настройва булевата на false
                        if ((n1%2==0 && n2!=1 && n3%2==0) && (isPrime==true))
                        {
                            Console.WriteLine($"{n1} {n2} {n3}"); 
                        }
                        //настройваме булевата отново на true за да е просто число освен ако булевата не стане false при проверката горе
                        isPrime = true;

                    }
                }
            }



        }
    }
}
