using System;

namespace EvenPower2
{
    class Program
    {
        static void Main(string[] args)
        {
            //Да се напише програма, която чете число n, въведено от потребителя,
            //и печата четните степени на 2 ≤ 2n: 20, 22, 24, 26, …, 2n. 

            int n = int.Parse(Console.ReadLine());

            //вдигаме 2 на всички четни степени от 1 до n включващи се в n(прочетеното от конзолата число)
            for (int pow = 0; pow <= n; pow++)
            {
                //правим проверка за да видим дали числото в pow е четно
                if (pow % 2 == 0)
                {
                    ///Math.Pow приема 2 параметъра число и степен на която да го повдигне.
                    ///(в случачт 2 на стемен pow което е променливата на for и вече сме проверили дали е четно число)
                    Console.WriteLine(Math.Pow(2, pow));
                }
            }

            //Решние 2 
            ///Същото решение може да бъде направено като не минаваме с pow++ през  всички числа от условието
            ///а минаваме от 0 през 2 (2,4,6,8) като така няма да има нужда от проверката
            for (int pow = 0; pow <= n; pow+=2)
            {

                    ///Math.Pow приема 2 параметъра число и степен на която да го повдигне.
                    ///(в случачт 2 на стемен pow което е променливата на for и вече сме проверили дали е четно число)
                    Console.WriteLine(Math.Pow(2, pow));
            }
        }
    }
}
