using System;

namespace TrickDriver
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма която пресмята колко пари ще изкара шофьор на ТИР за един сезон.
            //На входа програмата получава през кой сезон ще работи шофьора, както и колко километра на месец ще кара.
            //Един сезон е 4 месеца.
            //Според зависи сезона и броя километри на месец ще му се заплаща различна сума на километър:

            //	                              Пролет /Есен      Лято              Зима
            //км на месец <= 5000             0.75 лв./ км   0.90 лв./ км     1.05 лв./ км
            //5000 < км на месец <= 10000     0.95 лв./ км   1.10 лв./ км     1.25 лв./ км
            //10000 < км на месец <= 20000    1.45 лв./ км – за който и да е сезон

            //След като са извадени 10 % за данъци се отпечатват останалите пари.
            //Вход
            //Входът се чете от конзолата и се състои от два реда:
            //•	Първи ред – Сезон – текст "Spring", "Summer", "Autumn" или "Winter"
            //•	Втори ред –  Километри на месец – реално число в интервала[10.00...20000.00]
            //Изход
            //На конзолата трябва да се отпечатат едно число:
            //След като са извадени 10 % за данъци се отпечатват останалите пари.
            //•	Заплатата на шофьора след данъците, форматирана до втория знак след десетичната запетая.

            //1. Четем от конзолата
            //•	Първи ред – Сезон – текст "Spring", "Summer", "Autumn" или "Winter"
            string season = Console.ReadLine();
            //•	Втори ред –  Километри на месец – реално число в интервала[10.00...20000.00]
            double kmPerMonth = double.Parse(Console.ReadLine());

            //променливи
            //заплащане
            double payPerKm = 0;

            //2.проверяваме през кой сезон ще работи и колко километра на месец ще минава.
            //Според зависи сезона и броя километри на месец ще му се заплаща различна сума на километър:

            if ((season == "Spring" || season == "Autumn") && kmPerMonth <= 5000)
            {
                //	                              Пролет /Есен  
                //км на месец <= 5000             0.75 лв./ км  
                payPerKm = 0.75;

            }
            else if ((season == "Spring" || season == "Autumn") && kmPerMonth <= 10000)
            {
                //	                              Пролет /Есен 
                //5000 < км на месец <= 10000     0.95 лв./ км 
                payPerKm = 0.95;
            }
            else if (season == "Summer" && kmPerMonth <= 5000)
            {
                //	                               Лято             
                //км на месец <= 5000           0.90 лв./ км 
                payPerKm = 0.90;
            }
            else if (season == "Summer" && kmPerMonth <= 10000)
            {
                //	                                  Лято          

                //5000 < км на месец <= 10000      1.10 лв./ км 
                payPerKm = 1.10;
            }
            else if (season == "Winter" && kmPerMonth <= 5000)
            {
                //	                                   Зима
                //км на месец <= 5000              1.05 лв./ км
                payPerKm = 1.05;
            }
            else if (season == "Winter" && kmPerMonth <= 10000)
            {
                //	                                    Зима

                //5000 < км на месец <= 10000       1.25 лв./ км
                payPerKm = 1.25;
            }
            else 
            {
                payPerKm = 1.45;
            }
            //изчисляваме 4 месеца по километрите на месец по цената за км
            double salary = 4 * kmPerMonth * payPerKm;
            //След като са извадени 10 % за данъци се отпечатват останалите пари.
            salary -= salary * 0.10;
            //•	Заплатата на шофьора след данъците, форматирана до втория знак след десетичната запетая.
            Console.WriteLine($"{salary:f2}");

        }
    }
}
