using System;

namespace VowelsSum
{
    class Program
    {
        static void Main(string[] args)
        {
            //Да се напише програма, която чете текст (стринг), въведен от потребителя, и изчислява и отпечатва
            //сумата от стойностите на гласните букви според таблицата по-долу:
            //буква       a   e   i   o   u
            //стойност    1   2   3   4   5
            string text = Console.ReadLine();

            //всчки charecter от тежта може да се вземе по индекас му 
            //ползваме .Lenght метхода за да вземем дължината като брой букви
            //като от 0 до < text.Lenght това ще бъде от 0 до едно по малко от дължината което всъщност е номера 
            ////на последният индекс. Същото би било ако кажем от 0 до <= text.Lenght -1 
            ///за да остраним последният номер на буква тъй като, като индекс него го няма тъй като индексите започват от 0
            ///в случаят int i ще ходи от 0 до  < text.lenght //което ще бъде индексите на думата 
            ///
            int sum = 0;
            for (int i = 0; i < text.Length; i++)
            {
                //създаваме променлива която взима буквата от съответният индекс
                char current = text[i];
                switch (current) 
                {
                    case 'a':
                        sum += 1;
                        break;
                    case 'e':
                        sum += 2;
                        break;
                    case 'i':
                        sum += 3;
                        break;
                    case 'o':
                        sum += 4;
                        break;
                    case 'u':
                        sum += 5;
                        break;
                }  
            }
            Console.WriteLine(sum);

        }
    }
}
