using System;

namespace Food_for_Pets
{
    class Program
    {
        static void Main(string[] args)
        {
            //Ани има два домашни любимеца - куче и котка.
            //Напишете програма, която изготвя статистика за храната на домашните любимци за определен брой дни.
            //Всеки ден кучето и котката изяждат различно количество от общата им храна.
            //На всеки трети ден получават награда -бисквитки.
            //Количеството на бисквитките е 10 % от общо изядената храна за деня.

            //Вашата програма трябва да отпечатва статистика за количеството бисквитки, които са изяли,
            //колко процента от първоначалното количество обща храна са изяли
            //и колко процента от изядената храна е изяло кучето и колко е изяла котката.

            //Вход
            //Първоначално се чете един ред://по скоро са 2та реда
            //•	Брой дни – цяло число в диапазона[1…30]
            //•	Общо количество храна – реално число в диапазона[0.00…10000.00]

            //След това за всеки ден се чете:
            //            o Количество изядена храна от кучето – цяло число в диапазона[10…500]
            //o Количество изядена храна от котката – цяло число в диапазона[10…500]


            //Изход
            //На конзолата да се отпечатват четири реда:
            //•	"Total eaten biscuits: {количество изядени бисквитки}gr."
            //•	"{процент изядена храна}% of the food has been eaten."
            //•	"{процент изядена храна от кучето}% eaten from the dog."
            //•	"{процент изядена храна от котката}% eaten from the cat."
            //Количеството изядени бисквитки трябва да бъде закръглено до най – близкото цяло число, а процентът храна трябва да бъде форматиран до втората цифра след десетичния знак.


            //1. Четем първите 2 реда
            //•	Брой дни – цяло число в диапазона[1…30]
            int days = int.Parse(Console.ReadLine());
            //•	Общо количество храна – реално число в диапазона[0.00…10000.00]
            double foodQty = double.Parse(Console.ReadLine());

            //променливи
            // общо изядена храна от кучето
            double totallFoodDog = 0;
            // общо изядена храна от котката
            double totallFoodCat = 0;
            //общо изядена храна
            double totallFoodEaten = 0;
            //брояч на количеството бисквити което се дава на всеки 3ти ден
            double buiscetsQty = 0;


            //След това за всеки ден се чете:
            //o Количество изядена храна от кучето – цяло число в диапазона[10…500]
            //o Количество изядена храна от котката – цяло число в диапазона[10…500]
            for (int i = 1; i <= days; i++)
            {
                int dog = int.Parse(Console.ReadLine());
                int cat = int.Parse(Console.ReadLine());
                totallFoodDog += dog;
                totallFoodCat += cat;
                totallFoodEaten = totallFoodDog + totallFoodCat;
                //На всеки трети ден получават награда -бисквитки.
                //Количеството на бисквитките е 10 % от общо изядената храна за деня.
                if (i%3==0)
                {
                    buiscetsQty += (dog+cat) * 0.10;
                }
            }

            //•	"Total eaten biscuits: {количество изядени бисквитки}gr."
            Console.WriteLine($"Total eaten biscuits: {Math.Round(buiscetsQty)}gr.");
            //•	"{процент изядена храна}% of the food has been eaten."
            Console.WriteLine($"{(totallFoodEaten/foodQty)*100:f2}% of the food has been eaten.");
            //•	"{процент изядена храна от кучето}% eaten from the dog."
            Console.WriteLine($"{(totallFoodDog/totallFoodEaten)*100:f2}% eaten from the dog.");
            //•	"{процент изядена храна от котката}% eaten from the cat."
            Console.WriteLine($"{(totallFoodCat/totallFoodEaten)*100:f2}% eaten from the cat.");
            //Количеството изядени бисквитки трябва да бъде закръглено до най – близкото цяло число,
            //а процентът храна трябва да бъде форматиран до втората цифра след десетичния знак.


        }
    }
}
