using System;

namespace Equal_Pairs
{
    class Program
    {
        static void Main(string[] args)
        {
            // Дадени са 2 * n - на брой числа.
            // Първото и второто формират двойка, третото и четвъртото също и т.н.
            // Всяка двойка има стойност – сумата от съставящите я числа.
            // Напишете програма, която проверява дали
            // всички двойки имат еднаква стойност или печата максималната разлика между две последователни двойки.
            // Ако всички двойки имат еднаква стойност, отпечатайте "Yes, value={Value}" + стойността.
            // В противен случай отпечатайте "No, maxdiff={Difference}" + максималната разлика.

            // четат се 2 числа по N на брой пъти
            //N се чете от конзолата

            // Всяка двойка има стойност – сумата от съставящите я числа.

            // проверява дали
            // всички двойки имат еднаква стойност или печата максималната разлика между две последователни двойки.
            //някъде трябва да записвам разликите между всяка двойка последователно 1ва и 2ра 3та и 4та и тн.


            //1.Четем колко двойки числа ще има
            int pairs = int.Parse(Console.ReadLine());

            //променливи
            //предишна сума от довика числа
            int previousSum = 0;
            //момента сума
            int currentSum = 0;
            //разлика между сумата на двойките
            int diffrence = 0;
            int maxDiff = 0;


            //2. правим цикъл в който ще се четат числата от всяка двойка
            //правим си променливи за числата които да се четат
            int number1 = 0;
            int number2 = 0;

            

            for (int i = 0; i < pairs; i++)
            {

                ///Някак трява да записваме сумите от отделните двойки но незнаем колко ще са те 
                ///или да записваме предишна и сегашна сума
                number1 = int.Parse(Console.ReadLine());
                number2 = int.Parse(Console.ReadLine());

                currentSum = number1 + number2;

                //ako цикъла се е завъртял веднъж
                if (i > 0)
                {

                    diffrence = Math.Abs(currentSum - previousSum);
                }

                //ако моментната разликата е по голяма от maxDiff я присвояваме.
                if (diffrence > maxDiff)
                {
                    maxDiff = diffrence;
                }
                //присвояваме моментата сума към предишна сума и зануляваме моментата за следващият цикъл
                previousSum = currentSum;
                currentSum = 0;

                // проверява дали
                // всички двойки имат еднаква стойност или печата максималната разлика между две последователни двойки.





            }
            //проверяваме дали има разлика 
            if (maxDiff == 0)
            {
                Console.WriteLine($"Yes, value={previousSum}");
            }
            else
            {
                Console.WriteLine($"No, maxdiff={maxDiff}");
            }


            // проверява дали
            // всички двойки имат еднаква стойност или печата максималната разлика между две последователни двойки.
            

        }
    }
}
