using System;

namespace CarToGo
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която спрямо даден бюджет и сезон да пресмята цената, типа и класа на кола под наем.
            //Сезоните са лято и зима – "Summer" и "Winter".Типа коли са кабрио и джип – "Cabrio" и "Jeep".

            //•	При бюджет по - малък или равен от 100лв.:
            //o Класът ще е -"Economy class"
            //o Според сезона колата и цената ще са:
            //	Лято – Кабрио – 35 % от бюджета
            //	Зима – Джип – 65 % от бюджета

            //•	При бюджет по - голям от 100лв.и по-малък или равен от 500лв.:
            //o Класът ще е -"Compact class"
            //o Според сезона колата и цената ще са:
            //	Лято – Кабрио – 45 % от бюджета
            //	Зима – Джип – 80 % от бюджета

            //•	При бюджет по - голям от 500лв.:
            //o Класът ще е – "Luxury class"
            //o За всеки сезон колата ще е джип и цената ще е:
            //	90 % от бюджета

            // Вход
            //Входът се чете от конзолата и се състои от два реда:
            //•	Първи ред – Бюджет – реално число в интервала[10.00...10000.00]
            //•	Втори ред –  Сезон – текст "Summer" или "Winter"
            //Изход
            //На конзолата трябва да се отпечатат два реда.
            //•	Първи ред – "{Вид на класа}"
            //o   "Economy class", "Compact class" или "Luxury class"
            //•	Втори ред – "{Вид на колата} - {цена на колата}"
            //o Видът на колата – "Cabrio" или "Jeep"
            //o Цената трябва да е форматирана до втория знак след запетаята

            //1.Четем
            //•	Първи ред – Бюджет – реално число в интервала[10.00...10000.00]
            double budjet = double.Parse(Console.ReadLine());
            //•	Втори ред –  Сезон – текст "Summer" или "Winter"
            string season = Console.ReadLine();

            //променливи
            //клас на колата
            string clas = "";
            //вид кола
            string car = "";
            //цена
            double price = 0;


            //2. проверяваме бюджета и според него присвояваме клас, вид кола и цена към променливите
            if (budjet<=100)
            {
                //•	При бюджет по - малък или равен от 100лв.:
                //o Класът ще е -"Economy class"
                clas = "Economy class";
                //o Според сезона колата и цената ще са:
                //	Лято – Кабрио – 35 % от бюджета
                //	Зима – Джип – 65 % от бюджета
                if (season == "Summer")
                {
                    car = "Cabrio";
                    price += budjet * 0.35;
                }
                else 
                {
                    car = "Jeep";
                    price += budjet * 0.65;
                }
            }
            else if (budjet>100 && budjet<=500)
            {
                //•	При бюджет по - голям от 100лв.и по-малък или равен от 500лв.:
                //o Класът ще е -"Compact class"
                clas = "Compact class";
                //o Според сезона колата и цената ще са:
                //	Лято – Кабрио – 45 % от бюджета
                //	Зима – Джип – 80 % от бюджета
                if (season == "Summer")
                {
                    car = "Cabrio";
                    price += budjet * 0.45;
                }
                else
                {
                    car = "Jeep";
                    price += budjet * 0.80;
                }
            }
            else
            {
                //•	При бюджет по - голям от 500лв.:
                //o Класът ще е – "Luxury class"
                clas = "Luxury class";
                //o За всеки сезон колата ще е джип и цената ще е:
                //	90 % от бюджета
                car = "Jeep";
                price += budjet * 0.90;
            }

            //Изход
            //На конзолата трябва да се отпечатат два реда.
            //•	Първи ред – "{Вид на класа}"
            //o   "Economy class", "Compact class" или "Luxury class"
            //•	Втори ред – "{Вид на колата} - {цена на колата}"
            //o Видът на колата – "Cabrio" или "Jeep"
            //o Цената трябва да е форматирана до втория знак след запетаята

            Console.WriteLine($"{clas}");
            Console.WriteLine($"{car} - {price:f2}");

        }
    }
}
