using System;

namespace Grades
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която да пресмята статистика на оценки от изпит.
            //В началото програмата получава броят на студентите явили се на изпита и за всеки студент неговата оценка.

            //На края програмата трябва да изпечата процента на студенти с оценка
            //между 2.00 и 2.99, между 3.00 и 3.99, между 4.00 и 4.99, между 5.00 или повече.
            //Също така и средният успех на изпита.

            //Вход
            //От конзолата се четат поредица от числа, всяко на отделен ред:
            //•	На първия ред – броя на студентите явили се на изпит – цяло число в интервала[1...1000]
            //•	За всеки един студент на отделен ред – оценката от изпита – реално число в интервала[2.00...6.00]
            //Изход
            //Да се отпечатат на конзолата 5 реда, които съдържат следната информация:
            //Ред 1 - "Top students: {процент студенти с успех 5.00 или повече}%"
            //Ред 2 - "Between 4.00 and 4.99: {между 4.00 и 4.99 включително}%"
            //Ред 3 - "Between 3.00 and 3.99: {между 3.00 и 3.99 включително}%"
            //Ред 4 - "Fail: {по-малко от 3.00}%"
            //Ред 5 - "Average: {среден успех}"
            //Всички числа трябва да са форматирани до вторият знак след десетичната запетая.

            //1.Четем броят на студентите явили се на изпит
            int students = int.Parse(Console.ReadLine());

            //променливи
            //броячи за оценки между 2.00 и 2.99, между 3.00 и 3.99, между 4.00 и 4.99, между 5.00 или повече.
            int grade2to299 = 0;
            int grade3to399 = 0;
            int grade4to499 = 0;
            int grade5orMore = 0;
            //сбор на всички оценки
            double allGradesSum = 0;

            //2.Четем За всеки един студент на отделен ред – оценката от изпита – реално число в интервала[2.00...6.00]
            //правим си променлива за оценката която ще четем в цикъл който ще се върти за всеки стyдент
            double grade = 0;
            for (int i = 0; i < students; i++)
            {
                grade = double.Parse(Console.ReadLine());
                //броячи за оценки между 2.00 и 2.99, между 3.00 и 3.99, между 4.00 и 4.99, между 5.00 или повече.
                if (grade < 3)
                {
                    grade2to299++;
                }
                else if (grade < 4)
                {
                    grade3to399++;
                }
                else if (grade < 5)
                {
                    grade4to499++;
                }
                else 
                {
                    grade5orMore++;
                }
                //сбор на всички уценки
                allGradesSum += grade;
            }

            //На края програмата трябва да изпечата процента на студенти с оценка
            //между 2.00 и 2.99, между 3.00 и 3.99, между 4.00 и 4.99, между 5.00 или повече.//(броят от броячите на дадени оценки / всички студенти * 100)
            //Също така и средният успех на изпита.// (сбора на всички оценки / на всички студенти)


            //Да се отпечатат на конзолата 5 реда, които съдържат следната информация:
            //Ред 1 - "Top students: {процент студенти с успех 5.00 или повече}%"
            Console.WriteLine($"Top students: {((double)grade5orMore/(double)students)*100:f2}%");
            //Ред 2 - "Between 4.00 and 4.99: {между 4.00 и 4.99 включително}%"
            Console.WriteLine($"Between 4.00 and 4.99: {((double)grade4to499 / (double)students) * 100:f2}%");
            //Ред 3 - "Between 3.00 and 3.99: {между 3.00 и 3.99 включително}%"
            Console.WriteLine($"Between 3.00 and 3.99: {((double)grade3to399 / (double)students) * 100:f2}%");
            //Ред 4 - "Fail: {по-малко от 3.00}%"
            Console.WriteLine($"Fail: {((double)grade2to299 / (double)students) * 100:f2}%");
            //Ред 5 - "Average: {среден успех}"
            Console.WriteLine($"Average: {(double)allGradesSum/(double)students:f2}");
            //Всички числа трябва да са форматирани до вторият знак след десетичната запетая.
        }
    }
}
