using System;

namespace Letters_Combinations
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която да принтира на конзолата всички комбинации от 3 букви в зададен интервал,
            //като се пропускат комбинациите съдържащи зададена от конзолата буква.

            //Накрая трябва да се изпринтира броят на отпечатаните комбинации.

            //Вход
            //Входът се чете от конзолата и съдържа точно 3 реда:
            //Ред 1.Малка буква от английската азбука за начало на интервала – от ‘a’ до ‚z’.
            //Ред 2.Малка буква от английската азбука за край на интервала  – от първата буква до ‚z’.
            //Ред 3.Малка буква от английската азбука – от ‘a’ до ‚z’ – като комбинациите съдържащи тази буквата се пропускат.
            //Изход
            //Да се отпечатат на един ред всички комбинации отговарящи на условието плюс броят им разделени с интервал.

            //1.Четем
            //Ред 1.Малка буква от английската азбука за начало на интервала – от ‘a’ до ‚z’.
            char beginigLetter = char.Parse(Console.ReadLine());
            //Ред 2.Малка буква от английската азбука за край на интервала  – от първата буква до ‚z’.
            char endingLetter = char.Parse(Console.ReadLine());
            //Ред 3.Малка буква от английската азбука – от ‘a’ до ‚z’ – като комбинациите съдържащи тази буквата се пропускат
            char letterToBeMissed = char.Parse(Console.ReadLine());

            //променливи 
            //char към който ще добавяме стойноста на i в for цикъла която ще отговаря на съответната буква
            string currentCombination = "";
            //брояч на комбинациите
            int combinationQty = 0;

            //да принтира на конзолата всички комбинации от 3те букви в зададеният интервал,
            //започващ от променливата beginigLetter и завършващ endingLetter
            //като се пропускат комбинациите съдържащи зададената от конзолата буква в променливата letterToBeMissed.
            //трябва да ползваме съответните стойности от ASKII табицата. тъй като променливите са от тип
            //char символите са си със стойностите от таблицата.
            //ползваме и char вместо int в цикъла за брояч

            for (char first = beginigLetter; first <= endingLetter; first++)
            {
                //всички комбинации от 3те букви в зададеният интервал,
                for (char second = beginigLetter; second <= endingLetter; second++)
                {

                    for (char third = beginigLetter; third <=endingLetter; third++)
                    {
                        //пропускат се комбинациите съдържащи зададената от конзолата буква в променливата letterToBeMissed.
                       
                        //присвояваме стойностите на 3те символа към променлива от тип string като всяка стойност конвертираме с .ToString
                         currentCombination = (first.ToString() + second.ToString() + third.ToString());
                        //проверяваме дали променливата от тип стринг currentCombination съдържа буквата от променливата letterToBeMissed
                        // и ако да продължаваме към следващото завъртане на цикъла ако не изписваме комбинацията
                        //за judge конвертираме и letterToBeMissed тук защото не компилира
                        if (currentCombination.Contains(letterToBeMissed.ToString()))
                        {
                            continue;
                        }
                        else 
                        {
                            //трябва да се принтират на един ред с место
                            Console.Write($"{currentCombination} ");
                            //увеличаваме брояча за комбинации с 1
                            combinationQty++;
                            
                        }
                            
                        

                    }

                }


            }
            //накраят да принтираме и броят на комбинациите
            Console.Write($"{combinationQty}");


        }
    }
}
