using System;

namespace Bracelet_Stand
{
    class Program
    {
        static void Main(string[] args)
        {
            // Остават 5 дни до рождения ден на брата на Тереза.
            // Тя иска да му купи подарък и решава да си направи малък щанд и да продава плетени гривнички с мъниста,
            //за да събере достатъчно пари.

            //Вашата задача е да напишете програма, която да изчислява сумата, която Тереза е успяла да събере и да даде отговор на момичето,
            //дали тя ще може да купи подарък или не.

            //Трябва да се вземат предвид нейните разходи и цената на подаръка.

            //Вход
            //От конзолата се четат 4 реда:
            //•	Първи ред – джобните на Тереза на ден – реално число в интервала[1.00...100.00]
            //•	Втори ред – парите, които тя печели на ден от продажби – реално число в интервала[1.00...1000.00]
            //•	Трети ред – разходите на Тереза за целия период – реално число в интервала[1.00...1000.00]
            //•	Четвърти ред – цената на подаръка – реално число в интервала[1.00...10000.00]
            //Изход
            //На конзолата да се отпечата:
            //•	Ако са изработени достатъчно пари за подарък:
            //            o   "Profit: {всички спестени пари} BGN, the gift has been purchased."
            //•	Ако са изработени по-малко нужните пари:
            //o   "Insufficient money: {сумата, която не достига} BGN."
            //Числата трябва да са форматирани до втория знак след десетичната запетая.




            //1. Четем от конзолата
            //•	Първи ред – джобните на Тереза на ден – реално число в интервала[1.00...100.00]
            double ownMoneyPerDay = double.Parse(Console.ReadLine());
            //•	Втори ред – парите, които тя печели на ден от продажби – реално число в интервала[1.00...1000.00]
            double dayProfit = double.Parse(Console.ReadLine());
            //•	Трети ред – разходите на Тереза за целия период – реално число в интервала[1.00...1000.00]
            double expensesForAllDays = double.Parse(Console.ReadLine());
            //•	Четвърти ред – цената на подаръка – реално число в интервала[1.00...10000.00]
            double giftPrice = double.Parse(Console.ReadLine());

            //променливи
            //профит или спестени пари
            double profit = 0;


            //2. //Трябва да се вземат предвид нейните разходи и цената на подаръка.
            //дали тя ще може да купи подарък или не.
            // Остават 5 дни до рождения ден на брата на Тереза.

            profit = ownMoneyPerDay * 5 + dayProfit * 5;
            //изваждаме разходите
            profit -= expensesForAllDays;


            //На конзолата да се отпечата:
            //•	Ако са изработени достатъчно пари за подарък:
            //            o   "Profit: {всички спестени пари} BGN, the gift has been purchased."
            //•	Ако са изработени по-малко нужните пари:
            //o   "Insufficient money: {сумата, която не достига} BGN."
            //Числата трябва да са форматирани до втория знак след десетичната запетая.
            //проверяваме
            if (profit >= giftPrice)
            {
                Console.WriteLine($"Profit: {profit:f2} BGN, the gift has been purchased.");
            }
            else 
            {
                Console.WriteLine($"Insufficient money: {giftPrice-profit:f2} BGN.");
            }



        }
    }
}
