using System;

namespace HousePainting
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която да пресмята колко литра боя е нужна за боядисването на къщa.
            //Като за стените се използва зелена боя, а за покрива – червена.
            //Разхода на зелената боя е 1 литър за 3.4 м2, а на червената – 1 литър за 4.3 м2.

            //Стените имат следните размери:
            //•	Предната и задната стена са квадрати със страна „x“
            //o на предната стена има правоъгълна врата с широчина 1.2м и височина 2м
            //•	Страничните стени са правоъгълници със страни „x“ и „y“
            //o и на двете странични стени има по един квадратен прозорец със страна 1.5м


            //Покривът има следните размери:
            //•	Два правоъгълника със страни „x“ и „y“
            //•	Два равностранни триъгълника със страна „x“ и височина „h“
            //Трябва да пресметнете площта на всички страни и площта на покрива, за да
            //намерите колко литра от всяка боя ще са нужни.


            //Вход
            //От конзолата се четат 3 реда:
            //            1.x – височината на къщата – реално число в интервала[2...100]
            double x = double.Parse(Console.ReadLine());
            //2.y – дължината на страничната стена – реално число в интервала[2...100]
            double y = double.Parse(Console.ReadLine());
            //3.h – височината на триъгълната стена на прокрива – реално число в интервала[2...100]
            double h = double.Parse(Console.ReadLine());

            //Стените имат следните размери:
            //•	Предната и задната стена са квадрати със страна „x“
            // на предната стена има правоъгълна врата с широчина 1.2м и височина 2м
            double frontWall = x * x - 1.2 * 2;
            double backWall = x * x;
            //•	Страничните стени са правоъгълници със страни „x“ и „y“
            // и на двете странични стени има по един квадратен прозорец със страна 1.5м
            double sideWalls = (x * y - 1.5 * 1.5) * 2;

            //Покривът има следните размери:
            //•	Два правоъгълника със страни „x“ и „y“
            double roofSides = (x * y) * 2;
            //•	Два равностранни триъгълника със страна „x“ и височина „h“
            double roofTriangels = 2*(x * h)/2;



            //използва зелена боя, а за покрива – червена.
            //Разхода на зелената боя е 1 литър за 3.4 м2, а на червената – 1 литър за 4.3 м2
            //Трябва да пресметнете площта на всички страни и площта на покрива, за да
            //намерите колко литра от всяка боя ще са нужни.
            double greenPaintLiters = (frontWall + backWall + sideWalls) / 3.4;
            double redPaintLiters = (roofSides+roofTriangels) / 4.3;

            //Изход
            //Да се отпечатат на конзолата две числа всяко на нов ред:
            //•	Литрите зелена боя
            //•	Литритe червена боя
            //Форматирани до вторият знак след десетичната запетая.
            Console.WriteLine(greenPaintLiters.ToString("0.00"));
            Console.WriteLine(redPaintLiters.ToString("0.00"));

        }
    }
}
