using System;

namespace Computer_Firm
{
    class Program
    {
        static void Main(string[] args)
        {
            //Фирма за компютри е наела Вас, за да изчислите възможните продажби.

            //Да се напише програма, която за определен вид компютри пресмята средния рейтинг и направените продажби.

            //Първо се въвежда едно число от конзолата, което представлява броя на моделите компютри.

            //След това последователно за всеки от моделите компютри се въвежда по едно число:
            //•	Последната цифра(единиците) на това число представлява рейтингът, който е в интервала[2…6].
            //•	Останалите цифри(стотици и десетици) са възможните продажби, които ще се осъществят.

            //Компютърната продажба се скалира на база рейтинг:
            //•	Рейтинг 2 взима 0 % от  възможните продажби.
            //•	Рейтинг 3 взима 50 % от възможните продажби.
            //•	Рейтинг 4 взима 70 % от възможните продажби.
            //•	Рейтинг 5 взима 85 % от възможните продажби.
            //•	Рейтинг 6 взима 100 % от възможните продажби.
            //Вход
            //От конзолата се прочита:
            //            На първия ред:
            //•	n - брой компютри - цяло число в интервала[1…10]
            //На следващите n реда:
            //•	Числото, представляващо възможните продажби и рейтинга - цяло число в интервала[32…306]
            //Изход
            //На конзолата се отпечатват 2 редa:
            //•	Броят направени продажби
            //•	Средноаритметичният рейтинг за всички компютри
            //Продажбите и рейтингът трябва да са форматирани до втората цифра след десетичната запетая.


            //1.Четем 
            //Първо се въвежда едно число от конзолата, което представлява броя на моделите компютри.
                int models = int.Parse(Console.ReadLine());

            //променливи
            //брой възможни продажби
            int possibleSales = 0;
            //рейтинг 
            int rate = 0;
            //брояч за общият рейтинг за да го раделим после и да получим среден
            int rateCounter = 0;
            //брой направени продажби
            double sales = 0;


            //2.//След това последователно за всеки от моделите компютри се въвежда по едно число:
            //•	Последната цифра(единиците) на това число представлява рейтингът, който е в интервала[2…6].
            //•	Останалите цифри(стотици и десетици) са възможните продажби, които ще се осъществят.
            //for цикъл до свършване на моделите

            for (int i = 1; i <= models ; i++)
            {
                //въвежда по едно число:
                int number = int.Parse(Console.ReadLine());
                //Последната цифра(единиците) на това число представлява рейтингът, който е в интервала[2…6].
                //•	Останалите цифри(стотици и десетици) са възможните продажби, които ще се осъществят.

                //Компютърната продажба се скалира на база рейтинг:
                //•	Рейтинг 2 взима 0 % от  възможните продажби.
                //•	Рейтинг 3 взима 50 % от възможните продажби.
                //•	Рейтинг 4 взима 70 % от възможните продажби.
                //•	Рейтинг 5 взима 85 % от възможните продажби.
                //•	Рейтинг 6 взима 100 % от възможните продажби.
                rate = number % 10;
                possibleSales = number / 10;
                rateCounter += rate;
                if (rate ==3)
                {
                    sales += (double)possibleSales * 0.50;
                }
                else if (rate==4)
                {
                    sales += (double)possibleSales * 0.70;
                }
                else if (rate == 5)
                {
                    sales += (double)possibleSales * 0.85;
                }
                else if (rate == 6)
                {
                    sales += (double)possibleSales * 1.00;
                }


                //нулираме rate и possibleSales за следващата врътка
                rate = 0;
                possibleSales = 0;


            }

            //На конзолата се отпечатват 2 редa:
            //•	Броят направени продажби
            //•	Средноаритметичният рейтинг за всички компютри
            //Продажбите и рейтингът трябва да са форматирани до втората цифра след десетичната запетая.
            Console.WriteLine($"{(double)sales:f2}");
            Console.WriteLine($"{(double)rateCounter/(double)models:f2}");

        }
    }
}
