using System;

namespace TransportPrice
{
    class Program
    {
        static void Main(string[] args)
        {
            //Студент трябва да пропътува n километра. Той има избор измежду три вида транспорт:
            //•	Такси.Начална такса: 0.70 лв.Дневна тарифа: 0.79 лв. / км.Нощна тарифа: 0.90 лв. / км.
            //•	Автобус.Дневна / нощна тарифа: 0.09 лв. / км.Може да се използва за разстояния минимум 20 км.
            //•	Влак.Дневна / нощна тарифа: 0.06 лв. / км.Може да се използва за разстояния минимум 100 км.
            //Напишете програма, която въвежда броя километри n и период от деня(ден или нощ)
            //и изчислява цената на най - евтиния транспорт.

            //Вход
            // От конзолата се четат два реда:
            //•	Първият ред съдържа числото n – брой километри – цяло число в интервала[1…5000]
            double km = double.Parse(Console.ReadLine());
            //•	Вторият ред съдържа дума “day” или “night” – пътуване през деня или през нощта
            string dayNight = (Console.ReadLine());

            //•	Такси.Начална такса: 0.70 лв.Дневна тарифа: 0.79 лв. / км.Нощна тарифа: 0.90 лв. / км.
            double taxiDayPrice = 0.70 + 0.79 * km;
            double taxiNightPrice = 0.70 + 0.90 * km;
            //•	Автобус.Дневна / нощна тарифа: 0.09 лв. / км.Може да се използва за разстояния минимум 20 км.
            double busPrice = 0.09 * km;
            //•	Влак.Дневна / нощна тарифа: 0.06 лв. / км.Може да се използва за разстояния минимум 100 км.
            double trainPrice = 0.06 * km;
            //проверяваме дали километрите са по малко от 20 и повече от 100 за да изберем най евтиният транспорт
            //Да се отпечата на конзолата най-ниската цена за посочения брой километри,
            //форматирана до втория знак след десетичния разделител.
            if (km < 20)
            {
                if (dayNight == "day")
                {
                    Console.WriteLine($"{taxiDayPrice:f2}");
                }
                else
                    Console.WriteLine($"{taxiNightPrice:f2}");

            }
            else if (km >= 20 & km < 100)
            {
                Console.WriteLine($"{busPrice:f2}");
            }
            else
            {
                Console.WriteLine($"{trainPrice:f2}");
            }






        }
    }
}
