using System;

namespace Birthday_Party
{
    class Program
    {
        static void Main(string[] args)
        {
            //За рожденният ден на дъщеря си Людмила е решила да организира парти, на което да покани всичките ѝ съученици.

            //За целта е решила да наеме развлекателна зала за деца, чийто наем ще получите като вход от конзолата.

            //Напишете програма, с която да помогнете на Людмила да изчисли какъв бюджет ще ѝ бъде необходим,
            //като имате следната информация за допълнителните неща, необходими за тържеството:
            //•	Торта  – цената ѝ е 20 % от наема на залата
            //•	Напитки – цената им е 45 % по - малко от тази на тортата
            //•	Аниматор – цената му е 1 / 3 от цената за наема на залата
            //Вход
            //От конзолата се четe 1 ред:
            //•	Наем за залата – реално число в интервала[100.00..10000.00]
            //Изход
            //Да се отпечата на конзолата какъв бюджет ще бъде необходим за организиране на тържеството.

            //1. Четем 
            //Наем за залата – реално число в интервала[100.00..10000.00]
            double rent = double.Parse(Console.ReadLine());

            //променливи
            //budjetNeeded
            double budjetNeeded = 0;
            //цени за торта напитки и аниматор
            //•	Торта  – цената ѝ е 20 % от наема на залата
            double cakePrice = rent * 0.20;
            //•	Напитки – цената им е 45 % по - малко от тази на тортата
            double drinks = cakePrice - cakePrice * 0.45;
            //•	Аниматор – цената му е 1 / 3 от цената за наема на залата
            double animator = rent / 3;




            //2. изчисляваме колко общо ще и е необходимо като съберем всички разходи
            budjetNeeded = rent + cakePrice + drinks + animator;

            //3. //Изход
            //Да се отпечата на конзолата какъв бюджет ще бъде необходим за организиране на тържеството.
            Console.WriteLine($"{budjetNeeded:f1}");


        }
    }
}
