using System;

namespace Tournament_of_Christmas
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която проследява представянето на вашия отбор на благотворителен коледен турнир.

            //Всеки ден получавате имена на игри до команда "Finish".

            //Със спечелването на всяка една игра печелите по 20лв.за благотворителност.
            //Трябва да изчислите колко пари сте спечелили на края на деня.

            //Ако имате повече спечелени игри, отколкото загубени – вие сте победители този ден и увеличавате парите от него
            //с 10 %.

            //При приключване на турнира ако през повечето дни сте били победители печелите турнира и увеличавате
            //всичките спечелени пари с 20 %.

            //Никога няма да имате равен брой спечелени и загубени игри.

            //Вход
            //Първоначално от конзолата се прочита броя дни на турнира – цяло число в интервала[1… 20]
            //До получаване на командата "Finish" се чете:
            //•	Спорт  – текст
            //За всеки спорт се прочита:
            //o Резултат  – текст с възможности: "win" или "lose"

            //Изход
            //Накрая се отпечатва един ред:
            //•	Ако сте спечелили турнира:
            //     	"You won the tournament! Total raised money: {спечелените пари}"
            //•	Ако сте загубили на турнира:
            //            "You lost the tournament! Total raised money: {спечелените пари}"
            //Парите да бъдат форматирани до втората цифра след десетичния знак.


            //1..
            //Първоначално от конзолата се прочита броя дни на турнира – цяло число в интервала[1… 20]
            int days = int.Parse(Console.ReadLine());

            //променливи

            //броячи за спечелини и загубени игри
            int winGames = 0;
            int lostGames = 0;
            //брояч за спечелини дни
            int winDays = 0;
            //спечелени пари за дня
            double DayWonMoney = 0;
            //oбщо спечелени пари/
            double totalWonMoney = 0;


            //2.
            //for цикъл за всеки ден и в днего while цикъл до komanda Finish за игрите

            for (int i = 0; i < days; i++)

            {
                //До получаване на командата "Finish" се чете:
                //•	Спорт  – текст
                //Четем спорт като ще го четем и след всяко завъртане на while цикъла/ако получим Finish цикъла ще спре
                string sport = Console.ReadLine();
                while (sport!="Finish")
                {
                    //За всеки спорт се прочита:
                    //o Резултат  – текст с възможности: "win" или "lose"
                    //за загуба или победа
                    string winLose = Console.ReadLine();

                    //Със спечелването на всяка една игра печелите по 20лв.за благотворителност.
                    if (winLose == "win")
                    {
                        DayWonMoney += 20;
                        winGames++;
                    }
                    else 
                    {
                        lostGames++;
                    }

                    sport = Console.ReadLine();
                }
                //Трябва да изчислите колко пари сте спечелили на края на деня.
                //Ако имате повече спечелени игри, отколкото загубени – вие сте победители този ден и увеличавате парите от него
                //с 10 %.
                if (winGames > lostGames)
                {
                    DayWonMoney += DayWonMoney * 0.10;
                    totalWonMoney += DayWonMoney;
                    winDays++;
                }
                else 
                {
                    totalWonMoney += DayWonMoney;
                }

                //рестартираме променливити за деня
                DayWonMoney = 0;
                winGames = 0;
                lostGames = 0;
            }
            //При приключване на турнира ако през повечето дни сте били победители печелите турнира и увеличавате
            //всичките спечелени пари с 20 %.
            //Никога няма да имате равен брой спечелени и загубени игри.
            //Изход
            //Накрая се отпечатва един ред:
            //•	Ако сте спечелили турнира:
            //     	"You won the tournament! Total raised money: {спечелените пари}"
            //•	Ако сте загубили на турнира:
            //            "You lost the tournament! Total raised money: {спечелените пари}"
            //Парите да бъдат форматирани до втората цифра след десетичния знак.
            if (winDays > (days / 2))
            {
                totalWonMoney += totalWonMoney * 0.20;
                Console.WriteLine($"You won the tournament! Total raised money: {totalWonMoney:f2}");
            }
            else 
            {
                Console.WriteLine($"You lost the tournament! Total raised money: {totalWonMoney:f2}");
            }


        }
    }
}
