using System;

namespace InvalidNumer
{
    class Program
    {
        static void Main(string[] args)
        {
            //Дадено число е валидно, ако е в диапазона [100…200] или е 0. Да се напише програма,
            //която чете цяло число, въведено от потребителя, и печата "invalid" ако въведеното число не е валидно. 

            int num = int.Parse(Console.ReadLine());
            //ако num е равно на нула ИЛИ в скоби(num e по гоямо от 100 И && num e по малко или равно на 200)
            //скобите приоритизират това което е вътре спрчмо останалото преди това
            //тоест лчвата част казва ако равно на нула ИЛИ това което е в скобите
            //което има &&  и за него и двете твърдения трябва да са вярни
            if (num == 0 || (num >= 100 && num <= 200))
            {

            }
            else
            {
                Console.WriteLine("invalid");
            }

        }

    }
}
