using System;

namespace SchoolCamp
{
    class Program
    {
        static void Main(string[] args)
        {
            //Частно училище организира лагери за учениците по време на ваканциите.
            //В зависимост от вида на ваканцията(пролетна, лятна или зимна) и вида на групата(момчета/ момичета или смесена)
            //цената на нощувката в хотела е различна, както и спортът, който ще практикуват учениците.

            //                        Зимна ваканция      Пролетна ваканция     Лятна ваканция
            //момчета / момичета          9.60               7.20                      15
            //смесена група               10                 9.50                      20

            //Училището получава отстъпка от крайната цена, в зависимост от броя на настанените в хотела ученици:
            //•	Ако броят на учениците е 50 или повече, училището получава 50 % отстъпка
            //•	Ако броят на учениците е 20 или повече и в същото време по - малък от 50, училището получава 15 % отстъпка
            //•	Ако броят на учениците е 10 или повече и в същото време по - малък от 20, училището получава 5 % отстъпка
            //В таблицата по - долу са дадени спортовете, които ще се практикуват в зависимост от вида на ваканцията и групата:

            //                       Зимна ваканция    Пролетна ваканция     Лятна ваканция
            //момичета                Gymnastics         Athletics             Volleyball
            //момчета                    Judo            Tennis                 Football
            //смесена група              Ski             Cycling                Swimming

            //Да се напише програма, която пресмята цената, която ще заплати училището за нощувките и принтира спорта,
            //който ще се практикува от учениците.
            //Вход
            //От конзолата се четат 4 реда:
            // 1.Сезонът – текст - “Winter”, “Spring” или “Summer”;
            // 2.Видът на групата – текст - “boys”, “girls” или “mixed”;
            // 3.Брой на учениците – цяло число в интервала[1 … 10000];
            // 4.Брой на нощувките – цяло число в интервала[1 … 100].
            //Изход
            //На конзолата се отпечатва 1 ред:
            //•	Спортът, който са практикували учениците и цената за нощувките, която е заплатило училището, форматирана до втория знак след десетичната запетая, в следния формат:
            //            "{спортът} {цената} lv.“

            //1. Четем
            // .Сезонът – текст - “Winter”, “Spring” или “Summer”;
            string season = Console.ReadLine();
            // .Видът на групата – текст - “boys”, “girls” или “mixed”;
            string groupType = Console.ReadLine();
            // .Брой на учениците – цяло число в интервала[1 … 10000];
            int children = int.Parse(Console.ReadLine());
            // .Брой на нощувките – цяло число в интервала[1 … 100].
            int nights = int.Parse(Console.ReadLine());

            //променливи
            //цена за нощувка
            double nightPrice = 0;
            //спорт
            string sport = "";

            //В зависимост от вида на ваканцията(пролетна, лятна или зимна) и вида на групата(момчета/ момичета или смесена)
            //цената на нощувката в хотела е различна, както и спортът, който ще практикуват учениците.

            //                        Зимна ваканция      Пролетна ваканция     Лятна ваканция
            //момчета / момичета          9.60               7.20                      15
            //смесена група               10                 9.50                      20

            //                       Зимна ваканция    Пролетна ваканция     Лятна ваканция
            //момичета                Gymnastics         Athletics             Volleyball
            //момчета                    Judo            Tennis                 Football
            //смесена група              Ski             Cycling                Swimming

            //2. проверяваме вида на ваканцията и грyпата  и присвояваме цена за нощ и тип спорт към променливите
            if (season == "Winter")
            {
                if (groupType == "girls")
                {
                    nightPrice = 9.60;
                    sport = "Gymnastics";
                }
                else if (groupType == "boys")
                {
                    nightPrice = 9.60;
                    sport = "Judo";
                }
                else
                {
                    nightPrice = 10;
                    sport = "Ski";
                }

            }
            else if (season == "Spring")
            {
                if (groupType == "girls")
                {
                    nightPrice = 7.20;
                    sport = "Athletics";
                }
                else if (groupType == "boys")
                {
                    nightPrice = 7.20;
                    sport = "Tennis";
                }
                else
                {
                    nightPrice = 9.50;
                    sport = "Cycling";
                }
            }
            else 
            {
                if (groupType == "girls")
                {
                    nightPrice = 15;
                    sport = "Volleyball";
                }
                else if (groupType == "boys")
                {
                    nightPrice = 15;
                    sport = "Football";
                }
                else
                {
                    nightPrice = 20;
                    sport = "Swimming";
                }
            }

            //Училището получава отстъпка от крайната цена, в зависимост от броя на настанените в хотела ученици:
            //•	Ако броят на учениците е 50 или повече, училището получава 50 % отстъпка
            //•	Ако броят на учениците е 20 или повече и в същото време по - малък от 50, училището получава 15 % отстъпка
            //•	Ако броят на учениците е 10 или повече и в същото време по - малък от 20, училището получава 5 % отстъпка

            //3.изчисляваме общата цена и проверяваме колко са учениците за да махнем даденият процент от крайната цена

            double totall = nights * nightPrice*children;
            if (children >=50)
            {
                totall -= totall * 0.50;
            }
            else if (children >=20 && children<50 )
            {
                totall -= totall * 0.15;
            }
            else if (children >=10 && children<20)
            {
                totall -= totall * 0.05;
            }

            //4. //•	Спортът, който са практикували учениците и цената за нощувките, която е заплатило училището, форматирана до втория знак след десетичната запетая, в следния формат:
            //            "{спортът} {цената} lv.“

            Console.WriteLine($"{sport} {totall:f2} lv.");

        }
    }
}
