using System;

namespace NumbersDevidedBy3
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която печата всички числа в интервала от 1 до 100, който се делят на 3 без остатък,
            //по едно на ред.

            //Ще си направим for цикъл от едно до сто и ще проверяваме дали числото на което сме в момента се дели модулно на 3 без остатък
            //ако да ще го изпечатваме
            for (int i = 1; i <=100 ; i++)
            {
                if (i%3==0)
                {
                    Console.WriteLine(i);
                }
            }
        }
    }
}
