using System;

namespace Food_deliery
{
    class Program
    {
        static void Main(string[] args)
        {
            // Ресторант отваря врати и предлага няколко менюта на преференциални цени: 
            //•	Пилешко меню –  10.35 лв.
            //•	Меню с риба – 12.40 лв.
            //•	Вегетарианско меню  – 8.15 лв.

            //Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
            //Групата ще си поръча и десерт, чиято цена е равна на 20 % от общата сметка(без доставката). 
            //Цената на доставка е 2.50 лв и се начислява най - накрая.
            //Вход

            //От конзолата се четат 3 реда:

            //•	Брой пилешки менюта – цяло число в интервала[0 … 99]
            int chickenMenu = int.Parse(Console.ReadLine());

            //•	Брой менюта с риба – цяло число в интервала[0 … 99]
            int fishMenu = int.Parse(Console.ReadLine());

            //•	Брой вегетариански менюта – цяло число в интервала[0 … 99]
            int vegMenu = int.Parse(Console.ReadLine());
            //------------------------------------------------------------------
            //преференциални цени: 
            //•	Пилешко меню –  10.35 лв.
            double chickenMenuPrice = 10.35;
            //•	Меню с риба – 12.40 лв.
            double fishMenuPrice = 12.40;
            //•	Вегетарианско меню  – 8.15 лв.
            double vegMenuPrice = 8.15;
            //------------------------------------------------------------------
            double totall = chickenMenu * chickenMenuPrice + fishMenu * fishMenuPrice + vegMenu * vegMenuPrice;
            //Групата ще си поръча и десерт, чиято цена е равна на 20 % от общата сметка(без доставката). 
            double desert = totall * 0.2;

            //Цената на доставка е 2.50 лв и се начислява най - накрая.
            double tottalSum = totall + desert + 2.50;

            //Изход
            // изчислява колко ще струва на група хора да си поръчат храна за вкъщи
            //Да се отпечата на конзолата един ред:  "{цена на поръчката}"
            Console.WriteLine(tottalSum);

        }
    }
}
