using System;

namespace NumberPyramid
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която чете цяло число n, въведено от потребителя,
            //и отпечатва пирамида от числа като в примерите:

            //1. Четем от конзолата числото  n 
            int n = int.Parse(Console.ReadLine());

            //правим си променлива за брояч на числото на което сме в даден момент
            int current = 1;
            //2. Външен цикъл който започва от едно и върти докато стигне прочетеното от конзолата число

            for (int row = 1;row <= n; row++)
            {
                //и ътрешен цикъл който започва от едно и върти докато стигне номера на външният цикъл
                //.. първият път 1 път после 2 и тн. като отпечатва и увеличава настоящият номер1 всеки път
                for (int col = 1; col <= row; col++)
                {
                    Console.Write($"{current} ");
                    current++;
                    //Ако числото до което сме стигнали е по голямо от въведеното от конзолата прекъсваме вътрешният цикъл
                    if (current>n)
                    {
                        break;
                        
                    }
                }
                //Пишем празен ред за да разделим редовете
                Console.WriteLine("");
                //Ако числото до което сме стигнали е по голямо от въведеното от конзолата прекъсваме и външният цикъл цикъл
                if (current > n)
                {
                    break;

                }
            }
        }
    }
}
