using System;

namespace StreamOfLetters
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която прочита скрито съобщение в поредица от символи.

            //Те се получават по един на ред до получаване на командата "End".

            //Думите се образуват от буквите в реда на четенето им.

            //Символите, които не са латински букви трябва да бъдат игнорирани.
            //Думите скрити в потока са разделени от тайна команда от три букви – "c", "o" и "n".
            //При първото получаване на една от тези букви, тя се маркира като срещната, но не се запазва в думата.
            //При всяко следващо нейно срещане се записва нормално в думата.
            //След като са налични и трите символа от командата, се печата думата и интервал " ".
            //Започва се нова дума, която по същия начин чака тайната команда, за да бъде отпечатана.

            //Вход
            //От конзолата се чете поредица от редове с един символ на всеки до получаване на командата "End".
            //Изход
            //На конзолата се печата на един ред всяка дума след тайната команда, следвана от интервал.

            //променливи
            //сума за тайни букви
            string secretCombination = "";
            //получена дума
            string word = "";
            //нова дума
            string newWord = "";
            

            //1. Четем символ
            string comandSymbol = Console.ReadLine();

            //2..Докато не получим команда Еnd четем пак и си правим проверките в while цикъл

            while (comandSymbol != "End")
            {
                //правим променлива char към която ще присвоваме прочетеното
                char currentSymbol = char.Parse(comandSymbol);

                //Символите, които не са латински букви трябва да бъдат игнорирани.
                //ще ползваме кодовете от ASKII таблицата за да проверяваме дали currentSymbol е малка или голяма буква от латинската азбука
                if ((currentSymbol >= 65 && currentSymbol <= 90) || (currentSymbol >= 97 && currentSymbol <= 122))
                {
                    //ако сегашният символ е 'с' и секретната комбинация НЕ съдържа 'с'
                    if (currentSymbol == 'c' && !(secretCombination.Contains("c")))
                    {
                        //ще добавим сегашният символ 'с' към секретната комбинация
                        secretCombination += char.ToString(currentSymbol);
                    }
                    //ако сегашният символ е 'o' и секретната комбинация НЕ съдържа 'o'
                    else if (currentSymbol == 'o' && !(secretCombination.Contains("o")))
                    {
                        //ще добавим сегашният символ 'o' към секретната комбинация
                        secretCombination += char.ToString(currentSymbol);
                    }
                    //ако сегашният символ е 'n' и секретната комбинация НЕ съдържа 'n'
                    else if (currentSymbol == 'n' && !(secretCombination.Contains("n")))
                    {
                        //ще добавим сегашният символ 'n' към секретната комбинация
                        secretCombination += char.ToString(currentSymbol);
                    }
                    //иначе ще добавим символа към дума
                    else
                    {
                        word += char.ToString(currentSymbol);
                    }

                    //След като са налични и трите символа от командата, се печата думата и интервал " ".
                    //Започва се нова дума, която по същия начин чака тайната команда, за да бъде отпечатана.

                    //ako в секретната дума са се събрали 'с''о''n'
                    //ще изпишем думата + място и след това ще изчистим секретната комбинация и думата за следващият цикъл
                    if (secretCombination.Contains("c") && secretCombination.Contains("o") && secretCombination.Contains("n"))
                    {
                        Console.Write(word+" ");
                        word = "";
                        secretCombination = "";
                    }

                }
                comandSymbol = Console.ReadLine();

            }



            //Думите скрити в потока са разделени от тайна команда от три букви – "c", "o" и "n".
            //При първото получаване на една от тези букви, тя се маркира като срещната, но не се запазва в думата.
            //При всяко следващо нейно срещане се записва нормално в думата.



        }


    }
}
