using System;

namespace Building
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която извежда на конзолата номерата на стаите в една сграда(в низходящ ред),
            //като са изпълнени следните условия:

            //•	На всеки четен етаж има само офиси
            //•	На всеки нечетен етаж има само апартаменти

            //•	Всеки апартамент се означава по следния начин: А{ номер на етажа}
            //            { номер на апартамента}, номерата на апартаментите започват от 0.

            //•	Всеки офис се означава по следния начин: О{ номер на етажа}
            //            { номер на офиса}, номерата на офисите също започват от 0.

            //•	На последният етаж винаги има апартаменти и те са по-големи от останалите, за това пред номера им пише 'L', вместо 'А'
            //.Ако има само един етаж, то има само големи апартаменти!
            //От конзолата се прочитат две цели числа -броят на етажите и броят на стаите за един етаж.




            //1.. променливи или вход за етажи и стай на етажи
            int floors = int.Parse(Console.ReadLine());
            int rooms = int.Parse(Console.ReadLine());
            //променлива 


            //2.. цикъл който се върти докато етажите не свършат, като започва в обратен ред от последният към първият
            //за да се отпечата първо последният етаж и да върви на долу.
            //и вътрешен цикъл докато стайте не свършат, след което се връща на външният цикъл за друг етаж
            for (int f  = floors; f >0 ; f--)
            {
                for (int r = 0; r < rooms; r++)
                {
                    //= докато се върти ако етажа е четен изпиши O(за офис)и ноемра на офиса
                    //= ако етажа е не четен изпиши А(за апартамент)и ноемра на апартамент
                    //•	Всеки апартамент се означава по следния начин: А{ номер на етажа}
                    //            { номер на апартамента}, номерата на апартаментите започват от 0.
                    //•	Всеки офис се означава по следния начин: О{ номер на етажа}
                    //            { номер на офиса}, номерата на офисите също започват от 0.

                    //.Ако има само един етаж, то има само големи апартаменти!
                    ///Ако е последният етаж На последният етаж винаги има апартаменти и те са по-големи от останалите, за това пред номера им пише 'L', 
                    if (f == floors || floors == 1)
                    {
                        Console.Write($"L{f}{r} ");
                    }
                    else 
                    {
                        //четен етаж
                        if (f % 2 == 0)
                        {
                            Console.Write($"O{f}{r} ");
                        }
                        //нечетен етаж
                        else 
                        {
                            Console.Write($"A{f}{r} ");
                        }
                    }
                }
                //Празен Conzol.WriteLine за да може след краят на вътрешният цикъл да слезем на нов ред
                Console.WriteLine();

            }
        }
    }
}
