using System;

namespace ToyShop
{
    class Program
    {
        static void Main(string[] args)
        {
            //Петя има магазин за детски играчки. Тя получава голяма поръчка, която трябва да изпълни.
            //С парите, които ще спечели иска да отиде на екскурзия. 
            //Цени на играчките:
            //•	Пъзел - 2.60 лв.
            //•	Говореща кукла -3 лв.
            //•	Плюшено мече -4.10 лв.
            //•	Миньон - 8.20 лв.
            //•	Камионче - 2 лв.
            //Ако поръчаните играчки са 50 или повече магазинът прави отстъпка 25 % от общата цена.
            //От спечелените пари Петя трябва да даде 10 % за наема на магазина.Да се пресметне дали
            //парите ще ѝ стигнат да отиде на екскурзия.

            //Вход
            //От конзолата се четат 6 реда:
            //1.Цена на екскурзията -реално число в интервала[1.00 … 10000.00]
            double tripPrice = double.Parse(Console.ReadLine());

            //2.Брой пъзели - цяло число в интервала[0… 1000]
            int soldPuzels = int.Parse(Console.ReadLine());
            //3.Брой говорещи кукли -цяло число в интервала[0 … 1000]
            int soldDols = int.Parse(Console.ReadLine());
            //4.Брой плюшени мечета -цяло число в интервала[0 … 1000]
            int soldBears = int.Parse(Console.ReadLine());
            //5.Брой миньони - цяло число в интервала[0 … 1000]
            int soldMinions = int.Parse(Console.ReadLine());
            //6.Брой камиончета - цяло число в интервала[0 … 1000]
            int soldTrucks = int.Parse(Console.ReadLine());
            //Общ брой поръчани играчки
            int tatalQt = soldPuzels + soldDols + soldBears + soldMinions + soldTrucks;

            //Цени на играчките:
            //•	Пъзел - 2.60 лв.
            //•	Говореща кукла -3 лв.
            //•	Плюшено мече -4.10 лв.
            //•	Миньон - 8.20 лв.
            //•	Камионче - 2 лв.
            //намираме общата съма на поръчката.
            double money = soldPuzels * 2.60 + soldDols * 3.00 + soldBears * 4.10 + soldMinions * 8.20 + soldTrucks * 2.00;

            //Ако поръчаните играчки са 50 или повече магазинът прави отстъпка 25 % от общата цена.
            if (tatalQt >= 50)
            {
                // съкратено на money = money-money*0.25;
                money -= money * 0.25;
            }
            //Петя трябва да даде 10 % за наема на магазина
            money -= money * 0.10;

            //Да се пресметне дали парите ще ѝ стигнат да отиде на екскурзия.
            // Изход
            //На конзолата се отпечатва:
            //•	Ако парите са достатъчни се отпечатва:
            //   "Yes! {оставащите пари} lv left."
            //•	Ако парите НЕ са достатъчни се отпечатва:
            //    "Not enough money! {недостигащите пари} lv needed."
            if (money>=tripPrice)
            {

                Console.WriteLine($"Yes! {money - tripPrice:f2} lv left.");

            }
            else
            {
                Console.WriteLine($"Not enough money! {tripPrice - money:f2} lv needed.");
            }











        }
    }
}
