using System;

namespace Suitcases_Load
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма, която ви помага при товаренето на куфари в багажника на самолет.

            //Всеки самолет има определен капацитет на багажника.

            //До получаване на команда "End" ще получавате обем на куфар.
            //Обемът на всеки трети куфар трябва да се увеличава с 10 %, поради загубата на пространство при начина на подреждане.
            //Ако свободното пространството в даден момент е по-малко от обема на куфар товаренето трябва да прекъсне.

            //Вход
            //Първоначално се чете един ред:
            //•	Капацитетът на багажника – реално число в диапазона[100.0…6000.0]

            //След това до получаване на команда "End" или до запълване на багажника, се чете по един ред:
            //            o Обем на куфар – реално число в диапазона[100.0…6000.0]
            //Изход
            //На конзолата да се отпечатат следните редове според случая:
            //•	При получаване на командата "End" се печата:
            //"Congratulations! All suitcases are loaded!"
            //•	Ако обемът на куфара е по-голям от оставащото пространство в багажника:
            //            "No more space!"
            //•	Накрая винаги се отпечатва статистика – колко багажа са натоварени:
            //"Statistic: {брой натоварени багажи} suitcases loaded."


            //1.Четем първи ред
            //•	Капацитетът на багажника – реално число в диапазона[100.0…6000.0]
            double loadCapacity = double.Parse(Console.ReadLine());

            //променливи
            //зает капацитет
            double capacityTaken = 0;
            // капацитет на куфар 0 за да можем на всеки 3ти куфар в while цикъла да го увеличим с 10%.
            double suitcaseCapacity = 0;
            //брояч за куфарите за да го ползваме за всеки 3ти куфар.
            int suitcases = 0;

            //След това до получаване на команда "End" или до запълване на багажника, се чете по един ред:
            //            o Обем на куфар – реално число в диапазона[100.0…6000.0]
            //правим си променлива стринг защото очакваме командата End но в while цикъл ще я и присвояваме към нея int и ще четем пак

            string input = Console.ReadLine();

            while (input!="End")
            {
                //Обемът на всеки трети куфар трябва да се увеличава с 10 %, поради загубата на пространство при начина на подреждане.
                suitcases++;// увеличаваме броят на куфарите и при проверка ще увеличим обема на всеки 3ти преди да го добавим към заетото пространство
                //o Обем на куфар – реално число в диапазона[100.0…6000.0]
                suitcaseCapacity = double.Parse(input);
                //проверката за 3ти куфар
                if (suitcases%3==0)
                {
                    suitcaseCapacity += suitcaseCapacity * 0.10;
                }
                //Ако свободното пространството в даден момент е по-малко от обема на куфар товаренето трябва да прекъсне.
                if ((loadCapacity - capacityTaken) < suitcaseCapacity)
                {
                    break;
                }
                capacityTaken += suitcaseCapacity;

                input = Console.ReadLine();
            }

            //Изход
            //На конзолата да се отпечатат следните редове според случая:
            //•	При получаване на командата "End" се печата:
            //"Congratulations! All suitcases are loaded!"
            //•	Ако обемът на куфара е по-голям от оставащото пространство в багажника:
            //            "No more space!"
            //•	Накрая винаги се отпечатва статистика – колко багажа са натоварени:
            //"Statistic: {брой натоварени багажи} suitcases loaded."
            if (input == "End")
            {
                Console.WriteLine("Congratulations! All suitcases are loaded!");
                Console.WriteLine($"Statistic: {suitcases} suitcases loaded.");
            }
            else 
            {
                Console.WriteLine("No more space!");
                Console.WriteLine($"Statistic: {suitcases-1} suitcases loaded.");
                
            }

        }
    }
}
