using System;

namespace Fish_Tank
{
    class Program
    {
        static void Main(string[] args)
        {
            //За рождения си ден Любомир получил аквариум с формата на паралелепипед.
            //Първоначално прочитаме от конзолата на отделни редове размерите му – дължина, широчина и височина в сантиметри.Трябва да се пресметне колко литра вода ще събира аквариума, ако се знае, че определен процент от вместимостта му е заета от пясък, растения, нагревател и помпа.
            //Един литър вода се равнява на един кубичен дециметър / 1л = 1 дм3 /.
            //Да се напише програма, която изчислява литрите вода,
            //която са необходими за напълването на аквариума.
            //Вход
            //От конзолата се четат 4 реда:
            // 1.Дължина в см – цяло число в интервала[10 … 500]
            int lenght = int.Parse(Console.ReadLine());
            //2.Широчина в см – цяло число в интервала[10 … 300]
            int with = int.Parse(Console.ReadLine());
            //3.Височина в см – цяло число в интервала[10… 200]
            int hight = int.Parse(Console.ReadLine());
            //4.Процент  – реално число в интервала[0.000 … 100.000]
            double percent = double.Parse(Console.ReadLine());
            percent = percent / 100;

            // Да се напише програма, която изчислява литрите вода,
            //която са необходими за напълването на аквариума.
            //Един литър вода се равнява на един кубичен дециметър / 1л = 1 дм3 /.
            double acuarium = lenght * with * hight;
            double watter = acuarium * 0.001;
            double litersMinusPercentage = watter * (1-percent);


            //Да се отпечата на конзолата едно число:
            Console.WriteLine(litersMinusPercentage);



        }
    }
}
