using System;

namespace Time_15Minutes
{
    class Program
    {
        static void Main(string[] args)
        {
            //Да се напише програма, която чете час и минути от 24-часово денонощие,
            //въведени от потребителя и изчислява колко ще е часът след 15 минути.
            //Резултатът да се отпечата във формат часове:минути. Часовете винаги са между 0 и 23,
            //а минутите винаги са между 0 и 59. Часовете се изписват с една или две цифри.
            //Минутите се изписват винаги с по две цифри, с водеща нула, когато е необходимо. 



            //1Четем минути и часове
            int hours = int.Parse(Console.ReadLine());
            int min = int.Parse(Console.ReadLine());
            //2 обръщаме часовете в минути и ги прибавяме към минутите
            // съкратеният запис на min = min + hours*60;
            min += hours * 60;
            //3 добавяне на 15 минути
            min += 15;
            //4 обръщаме отново минутите към часове и обратното.
            // делим цялочислено за часовете а за минутите делим модулно.
            hours = min / 60;
            min = min%60;
            //5 проверяваме дали часовете не са станали =24 ако са =0
            if (hours == 24)
            {
                hours = 0;
            }
            //6 отпечатване на резултата във формат часове:минути.
            //:D2 изважда числото с 0 пред него ако е от 1 до 9
            //съкратен вариант на Console.WriteLine($"{hours}:0{min}");
            Console.WriteLine($"{hours}:{min:D2}");


        }
    }
}
