using System;

namespace ReportSystem
{
    class Program
    {
        static void Main(string[] args)
        {
            //На благотворително събитие плащанията за закупените продукти винаги се редуват: плащане в брой и плащане с карта.
            //Установени са следните правила за заплащане:
            //•	Ако продуктът надвишава 100лв., за него не може да се плати в брой
            //•	Ако продуктът е на цена под 10лв., за него не може да се плати с кредитна карта
            //Програмата приключва или след като получим команда "End" или след като средствата бъдат събрани.

            //Вход
            //От конзолата се четат:
            //•	Сумата, която се очаква да бъде събрана от продажбите -цяло число в интервала[1... 10000]
            //На всеки следващ ред, до получаване на командата "End" или докато не се съберат нужните средства:
            //цените на предметите, които ще бъдат закупени -цяло число в интервала[1... 500]

            //Изход
            //На конзолата да се отпечата:
            //•	При успешна транзакция: "Product sold!"
            //•	При неуспешна транзакция: "Error in transaction!"
            //•	Ако сумата на всички закупени продукти надвиши или достигне очакваната сума, програмата трябва да приключи и на конзолата да се изпишат два реда:
            //o   "Average CS: {средно плащане в кеш на човек}"
            //o   "Average CC: {средно плащане с карта на човек}"
            //              Плащанията трябва да бъдат форматирани до втората цифра след десетичния знак.
            //•	При получаване на команда "End", да се изпише един ред:
            //            o   "Failed to collect required money for charity."

            //1. Четем от конзолата сумата която се очаква да бъде събрана цяло число
            int moneyToBeCollected = int.Parse(Console.ReadLine());


            //променливи
            //събрани пари в кеш и брояч на транзкации
            double cash = 0;
            int cashPayments = 0;
            //събрани пари с карта и брояч на транзкации
            double card = 0;
            int cardPayments = 0;
            //общо събрани пари
            double allMoney = 0;
            //брояч за while ciklite който ще използваме за всяко второ плащане което трябва да е с карта
            int cycle = 0;

            //2. While цикъл до получаване на команда End.
            //На всеки следващ ред, до получаване на командата "End" или докато не се съберат нужните средства:
            //цените на предметите, които ще бъдат закупени -цяло число в интервала[1... 500]
            //правим си променлива от string защото очакваме команда End като в цикъла ще направим променлива int към която ще присвояваме 
            //stringa докато не получим end когато цикъла ще свърши
            string input = Console.ReadLine();

            while (input != "End")
            {
                //първо добавяме 1 към променливата която ползваме за брояч на циклите
                cycle++;
                //цените на предметите, които ще бъдат закупени -цяло число в интервала[1... 500]
                double itemPrice = double.Parse(input);

                
               

                    //закупените продукти винаги се редуват: плащане в брой и плащане с карта.
                    //ako броячът модулно на 2 дава 0 тоест е четно плащаме с карта. 1вото е в брой 2рото с карта 3тото в брой, така ще се редуват.
                    if (cycle % 2 == 0)
                    {
                        //карта
                        //•	Ако продуктът е на цена под 10лв., за него не може да се плати с кредитна карта
                        if (itemPrice<10)
                        {

                            //•	При неуспешна транзакция: "Error in transaction!"
                            Console.WriteLine($"Error in transaction!");
                        }
                        else
                        {
                            //•	При успешна транзакция: "Product sold!"
                            Console.WriteLine($"Product sold!");
                            //добавяме сумата към плащанията с карта и към всички пари
                            card += itemPrice;
                            allMoney += itemPrice;
                            //добавяме 1 към брояча на плащания с карта
                            cardPayments++;
                        }
                    }
                    else
                    {
                        //брой
                        //•	Ако продуктът надвишава 100лв., за него не може да се плати в брой
                        if (itemPrice > 100)
                        {
                            Console.WriteLine($"Error in transaction!");
                        }
                        else 
                        {
                            //•	При успешна транзакция: "Product sold!"
                            Console.WriteLine($"Product sold!");
                            //добавяме сумата към плащанията keш и към всички пари
                            cash += itemPrice;
                            allMoney += itemPrice;
                            //добавяме 1 към брояча на плащания keш
                            cashPayments++;
                        }
                    }
                //до получаване на командата "End" или докато не се съберат нужните средства
                //ako събраните пари са по малко от нужните ще прочетем нова цена за предмет
               //ако са повече ще спрем цикъла
                if (allMoney < moneyToBeCollected)
                {
                    //четем отново сума на продуцт
                    input = Console.ReadLine();
                }
                else 
                {
                    break;
                }
            }
            if (allMoney>=moneyToBeCollected)
            {
                //o   "Average CS: {средно плащане в кеш на човек}"
                Console.WriteLine($"Average CS: {cash/cashPayments:f2}");
                //o   "Average CC: {средно плащане с карта на човек}"
                Console.WriteLine($"Average CC: {card/cardPayments:f2}");
                //              Плащанията трябва да бъдат форматирани до втората цифра след десетичния знак.
            }
            else
            {            //•	При получаване на команда "End", ако парите не са събрани да се изпише един ред:
                         //            o   "Failed to collect required money for charity."
                Console.WriteLine($"Failed to collect required money for charity.");

            }



        }
    }
}
