using System;

namespace WorldSwimingRecord
{
    class Program
    {
        static void Main(string[] args)
        {
            //Иван решава да подобри Световния рекорд по плуване на дълги разстояния.
            //На конзолата се въвежда рекордът в секунди, който Иван трябва да подобри,
            //разстоянието в метри, което трябва да преплува и времето в секунди, за което
            //плува разстояние от 1 м.Да се напише програма, която изчислява дали се е справил
            //със задачата, като се има предвид, че: съпротивлението на водата го забавя на всеки 15 м.с 12.5 секунди.
            //Когато се изчислява колко пъти Иванчо ще се забави, в резултат на съпротивлението на водата,
            //резултатът трябва да се закръгли надолу до най - близкото цяло число.
            //Да се изчисли времето в секунди, за което Иванчо ще преплува разстоянието и
            //разликата спрямо Световния рекорд. 


            //1. въвеждаме рекорда в секунди, разточнието в метри
            //и времето в секунди за 1 метър преплуван от Иван
            double record = double.Parse(Console.ReadLine());
            double swimedmeters = double.Parse(Console.ReadLine());
            double seconds = double.Parse(Console.ReadLine());

            //2. намираме колко пъти Иван ще се забави на всеки 15 м.с 12.5 секунди
            //резултатът трябва да се закръгли надолу до най - близкото цяло число.
            double delay = Math.Floor(swimedmeters / 15)*12.5;

            //3. намираме времето на иван (растоянието*времето за метър+забавянето)
            double ivanRecord = swimedmeters * seconds + delay;

            //4. проверяваме дали е успял да подобри рекорда в секунди
            //Изход
            //            Отпечатването на конзолата зависи от резултата:
            //•	Ако Иван е подобрил Световния рекорд(времето му е по-малко от рекорда) отпечатваме:
            //           o   " Yes, he succeeded! The new world record is {времето на Иван} seconds."
            //•	Ако НЕ е подобрил рекорда(времето му е по - голямо или равно на рекорда) отпечатваме:
            //           o   "No, he failed! He was {недостигащите секунди} seconds slower."
            //Резултатът трябва да се форматира до втория знак след десетичната запетая.
            if (ivanRecord<record)
            {
                Console.WriteLine($" Yes, he succeeded! The new world record is {ivanRecord:F2} seconds.");
            }
            else
            {
                //Math.Abs ни връща оабсолутната стойност тъй като в този случай световният рекорд е по
                //малко време от времето на Иван и ако не го използваме ще се получи негативен резултат.
                Console.WriteLine($"No, he failed! He was {Math.Abs(record-ivanRecord):f2} seconds slower.");
            }



        }
    }
}
