using System;

namespace TwoNumbersSum
{
    class Program
    {
        static void Main(string[] args)
        {
            //Напишете програма която проверява всички възможни комбинации от двойка числа в интервала от две дадени числа.
            //На изхода се отпечатва, коя поред е комбинацията чиито сбор от числата е равен на дадено магическо число.
            //Ако няма нито една комбинация отговаряща на условието се отпечатва съобщение, че не е намерено.


            //Вход
            //Входът се чете от конзолата и се състои от три реда:
            //•	Първи ред – начало на интервала – цяло число в интервала[1...999]
            //•	Втори ред – край на интервала – цяло число в интервала[по - голямо от първото число...1000]
            //•	Трети ред – магическото число – цяло число в интервала[1...10000]


            //Изход
            //На конзолата трябва да се отпечата един ред, според резултата:
            //•	Ако е намерена комбинация чиито сбор на числата е равен на магическото число
            //o   "Combination N:{пореден номер} ({първото число} + {второ число} = {магическото число})"
            //•	Ако не е намерена комбинация отговаряща на условието
            //o   "{броят на всички комбинации} combinations - neither equals {магическото число}"

            //1. Четем входа от начало на интервала, край и магическо число на отделни редове
            int begin = int.Parse(Console.ReadLine());
            int end = int.Parse(Console.ReadLine());
            int magicNumber = int.Parse(Console.ReadLine());
            //правим си променливи за сумата и брояч на комбинациите
            int sum = 0;
            int combinationCount = 0;
            
            //Правим си булева за намиране на първият резултат отговарящ на магическото число
            //по този начин може да проверим това в вътрешният цикъл но да приклучим всъщност после вънщният
            bool magic = false;
            //2. правим вложени цикли за да намерим комбинациите от числа от началото на интервала до краят
            ///тъй като е кобминация от двойка числа в интервал  циклите започва от числото begin зададено от конзолата и завършва на числото end зададено от конзлата
            for (int FirstNum = begin; FirstNum <= end; FirstNum++)
            {
                
                /// тъй като е кобминация от двойка числа в интервал  циклите започва от числото begin зададено от конзолата и завършва на числото end зададено от конзлата
                for (int secondNum = begin; secondNum <= end; secondNum++)
                {
                    sum = FirstNum + secondNum;
                    combinationCount++;
                    //3. проверяваме дали някоя от комбинациите отговаря на магическото число
                    //ако да правим булевата true изписваме каквото трябва и спираме вътрешният цикъл
                    if (sum==magicNumber)
                    {
                        magic = true;
                        Console.WriteLine($"Combination N:{combinationCount} ({FirstNum} + {secondNum} = {magicNumber})");
                        break;
                    }

                }
                ///След като вътрешният цикъл е спрят и булевата e true спираме и външният
                if (magic == true)
                {
                    break;
                }
            }
            ///Проверка ако всички цикли са завъртяни и булевата не е true изписваме каквото трябва
            if (magic == false)
            {
                Console.WriteLine($"{combinationCount} combinations - neither equals {magicNumber}");
            }





        }
    }
}
